earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Raspberry Pi Pico W (Picoprobe)
# -----------------------------------
rpipicowpicoprobe.name=Raspberry Pi Pico W (Picoprobe)
rpipicowpicoprobe.vid.0=0x2e8a
rpipicowpicoprobe.pid.0=0x0004
rpipicowpicoprobe.vid.1=0x2e8a
rpipicowpicoprobe.pid.1=0x0104
rpipicowpicoprobe.vid.2=0x2e8a
rpipicowpicoprobe.pid.2=0x4004
rpipicowpicoprobe.vid.3=0x2e8a
rpipicowpicoprobe.pid.3=0x4104
rpipicowpicoprobe.vid.4=0x2e8a
rpipicowpicoprobe.pid.4=0x8004
rpipicowpicoprobe.vid.5=0x2e8a
rpipicowpicoprobe.pid.5=0x8104
rpipicowpicoprobe.vid.6=0x2e8a
rpipicowpicoprobe.pid.6=0xc004
rpipicowpicoprobe.vid.7=0x2e8a
rpipicowpicoprobe.pid.7=0xc104
rpipicowpicoprobe.build.usbpid=-DSERIALUSB_PID=0xf00a
rpipicowpicoprobe.build.usbpwr=-DUSBD_MAX_POWER_MA=250
rpipicowpicoprobe.build.board=RASPBERRY_PI_PICO_W
rpipicowpicoprobe.build.mcu=cortex-m0plus
rpipicowpicoprobe.build.variant=rpipicow
rpipicowpicoprobe.upload.tool=picoprobe
rpipicowpicoprobe.upload.maximum_size=2097152
rpipicowpicoprobe.upload.maximum_data_size=262144
rpipicowpicoprobe.upload.wait_for_upload_port=true
rpipicowpicoprobe.upload.erase_cmd=
rpipicowpicoprobe.serial.disableDTR=false
rpipicowpicoprobe.serial.disableRTS=false
rpipicowpicoprobe.build.f_cpu=125000000
rpipicowpicoprobe.build.led=
rpipicowpicoprobe.build.core=rp2040
rpipicowpicoprobe.build.ldscript=memmap_default.ld
rpipicowpicoprobe.build.ram_length=256k
rpipicowpicoprobe.build.debugscript=picoprobe.tcl
rpipicowpicoprobe.build.boot2=boot2_w25q080_2_padded_checksum
rpipicowpicoprobe.build.vid=0x2e8a
rpipicowpicoprobe.build.pid=0xf00a
rpipicowpicoprobe.build.usb_manufacturer="Raspberry Pi"
rpipicowpicoprobe.build.usb_product="Pico W (Picoprobe)"
rpipicowpicoprobe.menu.flash.2097152_0=2MB (no FS)
rpipicowpicoprobe.menu.flash.2097152_0.upload.maximum_size=2093056
rpipicowpicoprobe.menu.flash.2097152_0.build.flash_length=2093056
rpipicowpicoprobe.menu.flash.2097152_0.build.eeprom_start=270528512
rpipicowpicoprobe.menu.flash.2097152_0.build.fs_start=270528512
rpipicowpicoprobe.menu.flash.2097152_0.build.fs_end=270528512
rpipicowpicoprobe.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
rpipicowpicoprobe.menu.flash.2097152_65536.upload.maximum_size=2027520
rpipicowpicoprobe.menu.flash.2097152_65536.build.flash_length=2027520
rpipicowpicoprobe.menu.flash.2097152_65536.build.eeprom_start=270528512
rpipicowpicoprobe.menu.flash.2097152_65536.build.fs_start=270462976
rpipicowpicoprobe.menu.flash.2097152_65536.build.fs_end=270528512
rpipicowpicoprobe.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
rpipicowpicoprobe.menu.flash.2097152_131072.upload.maximum_size=1961984
rpipicowpicoprobe.menu.flash.2097152_131072.build.flash_length=1961984
rpipicowpicoprobe.menu.flash.2097152_131072.build.eeprom_start=270528512
rpipicowpicoprobe.menu.flash.2097152_131072.build.fs_start=270397440
rpipicowpicoprobe.menu.flash.2097152_131072.build.fs_end=270528512
rpipicowpicoprobe.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
rpipicowpicoprobe.menu.flash.2097152_262144.upload.maximum_size=1830912
rpipicowpicoprobe.menu.flash.2097152_262144.build.flash_length=1830912
rpipicowpicoprobe.menu.flash.2097152_262144.build.eeprom_start=270528512
rpipicowpicoprobe.menu.flash.2097152_262144.build.fs_start=270266368
rpipicowpicoprobe.menu.flash.2097152_262144.build.fs_end=270528512
rpipicowpicoprobe.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
rpipicowpicoprobe.menu.flash.2097152_524288.upload.maximum_size=1568768
rpipicowpicoprobe.menu.flash.2097152_524288.build.flash_length=1568768
rpipicowpicoprobe.menu.flash.2097152_524288.build.eeprom_start=270528512
rpipicowpicoprobe.menu.flash.2097152_524288.build.fs_start=270004224
rpipicowpicoprobe.menu.flash.2097152_524288.build.fs_end=270528512
rpipicowpicoprobe.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
rpipicowpicoprobe.menu.flash.2097152_1048576.upload.maximum_size=1044480
rpipicowpicoprobe.menu.flash.2097152_1048576.build.flash_length=1044480
rpipicowpicoprobe.menu.flash.2097152_1048576.build.eeprom_start=270528512
rpipicowpicoprobe.menu.flash.2097152_1048576.build.fs_start=269479936
rpipicowpicoprobe.menu.flash.2097152_1048576.build.fs_end=270528512
rpipicowpicoprobe.menu.freq.133=133 MHz
rpipicowpicoprobe.menu.freq.133.build.f_cpu=133000000L
rpipicowpicoprobe.menu.freq.50=50 MHz
rpipicowpicoprobe.menu.freq.50.build.f_cpu=50000000L
rpipicowpicoprobe.menu.freq.100=100 MHz
rpipicowpicoprobe.menu.freq.100.build.f_cpu=100000000L
rpipicowpicoprobe.menu.freq.120=120 MHz
rpipicowpicoprobe.menu.freq.120.build.f_cpu=120000000L
rpipicowpicoprobe.menu.freq.125=125 MHz
rpipicowpicoprobe.menu.freq.125.build.f_cpu=125000000L
rpipicowpicoprobe.menu.freq.150=150 MHz (Overclock)
rpipicowpicoprobe.menu.freq.150.build.f_cpu=150000000L
rpipicowpicoprobe.menu.freq.175=175 MHz (Overclock)
rpipicowpicoprobe.menu.freq.175.build.f_cpu=175000000L
rpipicowpicoprobe.menu.freq.200=200 MHz (Overclock)
rpipicowpicoprobe.menu.freq.200.build.f_cpu=200000000L
rpipicowpicoprobe.menu.freq.225=225 MHz (Overclock)
rpipicowpicoprobe.menu.freq.225.build.f_cpu=225000000L
rpipicowpicoprobe.menu.freq.240=240 MHz (Overclock)
rpipicowpicoprobe.menu.freq.240.build.f_cpu=240000000L
rpipicowpicoprobe.menu.freq.250=250 MHz (Overclock)
rpipicowpicoprobe.menu.freq.250.build.f_cpu=250000000L
rpipicowpicoprobe.menu.freq.275=275 MHz (Overclock)
rpipicowpicoprobe.menu.freq.275.build.f_cpu=275000000L
rpipicowpicoprobe.menu.freq.300=300 MHz (Overclock)
rpipicowpicoprobe.menu.freq.300.build.f_cpu=300000000L
rpipicowpicoprobe.menu.opt.Small=Small (-Os) (standard)
rpipicowpicoprobe.menu.opt.Small.build.flags.optimize=-Os
rpipicowpicoprobe.menu.opt.Optimize=Optimize (-O)
rpipicowpicoprobe.menu.opt.Optimize.build.flags.optimize=-O
rpipicowpicoprobe.menu.opt.Optimize2=Optimize More (-O2)
rpipicowpicoprobe.menu.opt.Optimize2.build.flags.optimize=-O2
rpipicowpicoprobe.menu.opt.Optimize3=Optimize Even More (-O3)
rpipicowpicoprobe.menu.opt.Optimize3.build.flags.optimize=-O3
rpipicowpicoprobe.menu.opt.Fast=Fast (-Ofast) (maybe slower)
rpipicowpicoprobe.menu.opt.Fast.build.flags.optimize=-Ofast
rpipicowpicoprobe.menu.opt.Debug=Debug (-Og)
rpipicowpicoprobe.menu.opt.Debug.build.flags.optimize=-Og
rpipicowpicoprobe.menu.rtti.Disabled=Disabled
rpipicowpicoprobe.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
rpipicowpicoprobe.menu.rtti.Enabled=Enabled
rpipicowpicoprobe.menu.rtti.Enabled.build.flags.rtti=
rpipicowpicoprobe.menu.stackprotect.Disabled=Disabled
rpipicowpicoprobe.menu.stackprotect.Disabled.build.flags.stackprotect=
rpipicowpicoprobe.menu.stackprotect.Enabled=Enabled
rpipicowpicoprobe.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
rpipicowpicoprobe.menu.exceptions.Disabled=Disabled
rpipicowpicoprobe.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
rpipicowpicoprobe.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
rpipicowpicoprobe.menu.exceptions.Enabled=Enabled
rpipicowpicoprobe.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
rpipicowpicoprobe.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
rpipicowpicoprobe.menu.dbgport.Disabled=Disabled
rpipicowpicoprobe.menu.dbgport.Disabled.build.debug_port=
rpipicowpicoprobe.menu.dbgport.Serial=Serial
rpipicowpicoprobe.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
rpipicowpicoprobe.menu.dbgport.Serial1=Serial1
rpipicowpicoprobe.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
rpipicowpicoprobe.menu.dbgport.Serial2=Serial2
rpipicowpicoprobe.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
rpipicowpicoprobe.menu.dbglvl.None=None
rpipicowpicoprobe.menu.dbglvl.None.build.debug_level=
rpipicowpicoprobe.menu.dbglvl.Core=Core
rpipicowpicoprobe.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
rpipicowpicoprobe.menu.dbglvl.SPI=SPI
rpipicowpicoprobe.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
rpipicowpicoprobe.menu.dbglvl.Wire=Wire
rpipicowpicoprobe.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
rpipicowpicoprobe.menu.dbglvl.All=All
rpipicowpicoprobe.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
rpipicowpicoprobe.menu.dbglvl.NDEBUG=NDEBUG
rpipicowpicoprobe.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
rpipicowpicoprobe.menu.usbstack.picosdk=Pico SDK
rpipicowpicoprobe.menu.usbstack.picosdk.build.usbstack_flags=
rpipicowpicoprobe.menu.usbstack.tinyusb=Adafruit TinyUSB
rpipicowpicoprobe.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
rpipicowpicoprobe.menu.wificountry.worldwide=Worldwide
rpipicowpicoprobe.menu.wificountry.worldwide.build.wificc=-DWIFICC=CYW43_COUNTRY_WORLDWIDE
rpipicowpicoprobe.menu.wificountry.australia=Australia
rpipicowpicoprobe.menu.wificountry.australia.build.wificc=-DWIFICC=CYW43_COUNTRY_AUSTRALIA
rpipicowpicoprobe.menu.wificountry.austria=Austria
rpipicowpicoprobe.menu.wificountry.austria.build.wificc=-DWIFICC=CYW43_COUNTRY_AUSTRIA
rpipicowpicoprobe.menu.wificountry.belgium=Belgium
rpipicowpicoprobe.menu.wificountry.belgium.build.wificc=-DWIFICC=CYW43_COUNTRY_BELGIUM
rpipicowpicoprobe.menu.wificountry.brazil=Brazil
rpipicowpicoprobe.menu.wificountry.brazil.build.wificc=-DWIFICC=CYW43_COUNTRY_BRAZIL
rpipicowpicoprobe.menu.wificountry.canada=Canada
rpipicowpicoprobe.menu.wificountry.canada.build.wificc=-DWIFICC=CYW43_COUNTRY_CANADA
rpipicowpicoprobe.menu.wificountry.chile=Chile
rpipicowpicoprobe.menu.wificountry.chile.build.wificc=-DWIFICC=CYW43_COUNTRY_CHILE
rpipicowpicoprobe.menu.wificountry.china=China
rpipicowpicoprobe.menu.wificountry.china.build.wificc=-DWIFICC=CYW43_COUNTRY_CHINA
rpipicowpicoprobe.menu.wificountry.colombia=Colombia
rpipicowpicoprobe.menu.wificountry.colombia.build.wificc=-DWIFICC=CYW43_COUNTRY_COLOMBIA
rpipicowpicoprobe.menu.wificountry.czech_republic=Czech Republic
rpipicowpicoprobe.menu.wificountry.czech_republic.build.wificc=-DWIFICC=CYW43_COUNTRY_CZECH_REPUBLIC
rpipicowpicoprobe.menu.wificountry.denmark=Denmark
rpipicowpicoprobe.menu.wificountry.denmark.build.wificc=-DWIFICC=CYW43_COUNTRY_DENMARK
rpipicowpicoprobe.menu.wificountry.estonia=Estonia
rpipicowpicoprobe.menu.wificountry.estonia.build.wificc=-DWIFICC=CYW43_COUNTRY_ESTONIA
rpipicowpicoprobe.menu.wificountry.finland=Finland
rpipicowpicoprobe.menu.wificountry.finland.build.wificc=-DWIFICC=CYW43_COUNTRY_FINLAND
rpipicowpicoprobe.menu.wificountry.france=France
rpipicowpicoprobe.menu.wificountry.france.build.wificc=-DWIFICC=CYW43_COUNTRY_FRANCE
rpipicowpicoprobe.menu.wificountry.germany=Germany
rpipicowpicoprobe.menu.wificountry.germany.build.wificc=-DWIFICC=CYW43_COUNTRY_GERMANY
rpipicowpicoprobe.menu.wificountry.greece=Greece
rpipicowpicoprobe.menu.wificountry.greece.build.wificc=-DWIFICC=CYW43_COUNTRY_GREECE
rpipicowpicoprobe.menu.wificountry.hong_kong=Hong Kong
rpipicowpicoprobe.menu.wificountry.hong_kong.build.wificc=-DWIFICC=CYW43_COUNTRY_HONG_KONG
rpipicowpicoprobe.menu.wificountry.hungary=Hungary
rpipicowpicoprobe.menu.wificountry.hungary.build.wificc=-DWIFICC=CYW43_COUNTRY_HUNGARY
rpipicowpicoprobe.menu.wificountry.iceland=Iceland
rpipicowpicoprobe.menu.wificountry.iceland.build.wificc=-DWIFICC=CYW43_COUNTRY_ICELAND
rpipicowpicoprobe.menu.wificountry.india=India
rpipicowpicoprobe.menu.wificountry.india.build.wificc=-DWIFICC=CYW43_COUNTRY_INDIA
rpipicowpicoprobe.menu.wificountry.israel=Israel
rpipicowpicoprobe.menu.wificountry.israel.build.wificc=-DWIFICC=CYW43_COUNTRY_ISRAEL
rpipicowpicoprobe.menu.wificountry.italy=Italy
rpipicowpicoprobe.menu.wificountry.italy.build.wificc=-DWIFICC=CYW43_COUNTRY_ITALY
rpipicowpicoprobe.menu.wificountry.japan=Japan
rpipicowpicoprobe.menu.wificountry.japan.build.wificc=-DWIFICC=CYW43_COUNTRY_JAPAN
rpipicowpicoprobe.menu.wificountry.kenya=Kenya
rpipicowpicoprobe.menu.wificountry.kenya.build.wificc=-DWIFICC=CYW43_COUNTRY_KENYA
rpipicowpicoprobe.menu.wificountry.latvia=Latvia
rpipicowpicoprobe.menu.wificountry.latvia.build.wificc=-DWIFICC=CYW43_COUNTRY_LATVIA
rpipicowpicoprobe.menu.wificountry.liechtenstein=Liechtenstein
rpipicowpicoprobe.menu.wificountry.liechtenstein.build.wificc=-DWIFICC=CYW43_COUNTRY_LIECHTENSTEIN
rpipicowpicoprobe.menu.wificountry.lithuania=Lithuania
rpipicowpicoprobe.menu.wificountry.lithuania.build.wificc=-DWIFICC=CYW43_COUNTRY_LITHUANIA
rpipicowpicoprobe.menu.wificountry.luxembourg=Luxembourg
rpipicowpicoprobe.menu.wificountry.luxembourg.build.wificc=-DWIFICC=CYW43_COUNTRY_LUXEMBOURG
rpipicowpicoprobe.menu.wificountry.malaysia=Malaysia
rpipicowpicoprobe.menu.wificountry.malaysia.build.wificc=-DWIFICC=CYW43_COUNTRY_MALAYSIA
rpipicowpicoprobe.menu.wificountry.malta=Malta
rpipicowpicoprobe.menu.wificountry.malta.build.wificc=-DWIFICC=CYW43_COUNTRY_MALTA
rpipicowpicoprobe.menu.wificountry.mexico=Mexico
rpipicowpicoprobe.menu.wificountry.mexico.build.wificc=-DWIFICC=CYW43_COUNTRY_MEXICO
rpipicowpicoprobe.menu.wificountry.netherlands=Netherlands
rpipicowpicoprobe.menu.wificountry.netherlands.build.wificc=-DWIFICC=CYW43_COUNTRY_NETHERLANDS
rpipicowpicoprobe.menu.wificountry.new_zealand=New Zealand
rpipicowpicoprobe.menu.wificountry.new_zealand.build.wificc=-DWIFICC=CYW43_COUNTRY_NEW_ZEALAND
rpipicowpicoprobe.menu.wificountry.nigeria=Nigeria
rpipicowpicoprobe.menu.wificountry.nigeria.build.wificc=-DWIFICC=CYW43_COUNTRY_NIGERIA
rpipicowpicoprobe.menu.wificountry.norway=Norway
rpipicowpicoprobe.menu.wificountry.norway.build.wificc=-DWIFICC=CYW43_COUNTRY_NORWAY
rpipicowpicoprobe.menu.wificountry.peru=Peru
rpipicowpicoprobe.menu.wificountry.peru.build.wificc=-DWIFICC=CYW43_COUNTRY_PERU
rpipicowpicoprobe.menu.wificountry.philippines=Philippines
rpipicowpicoprobe.menu.wificountry.philippines.build.wificc=-DWIFICC=CYW43_COUNTRY_PHILIPPINES
rpipicowpicoprobe.menu.wificountry.poland=Poland
rpipicowpicoprobe.menu.wificountry.poland.build.wificc=-DWIFICC=CYW43_COUNTRY_POLAND
rpipicowpicoprobe.menu.wificountry.portugal=Portugal
rpipicowpicoprobe.menu.wificountry.portugal.build.wificc=-DWIFICC=CYW43_COUNTRY_PORTUGAL
rpipicowpicoprobe.menu.wificountry.singapore=Singapore
rpipicowpicoprobe.menu.wificountry.singapore.build.wificc=-DWIFICC=CYW43_COUNTRY_SINGAPORE
rpipicowpicoprobe.menu.wificountry.slovakia=Slovakia
rpipicowpicoprobe.menu.wificountry.slovakia.build.wificc=-DWIFICC=CYW43_COUNTRY_SLOVAKIA
rpipicowpicoprobe.menu.wificountry.slovenia=Slovenia
rpipicowpicoprobe.menu.wificountry.slovenia.build.wificc=-DWIFICC=CYW43_COUNTRY_SLOVENIA
rpipicowpicoprobe.menu.wificountry.south_africa=South Africa
rpipicowpicoprobe.menu.wificountry.south_africa.build.wificc=-DWIFICC=CYW43_COUNTRY_SOUTH_AFRICA
rpipicowpicoprobe.menu.wificountry.south_korea=South Korea
rpipicowpicoprobe.menu.wificountry.south_korea.build.wificc=-DWIFICC=CYW43_COUNTRY_SOUTH_KOREA
rpipicowpicoprobe.menu.wificountry.spain=Spain
rpipicowpicoprobe.menu.wificountry.spain.build.wificc=-DWIFICC=CYW43_COUNTRY_SPAIN
rpipicowpicoprobe.menu.wificountry.sweden=Sweden
rpipicowpicoprobe.menu.wificountry.sweden.build.wificc=-DWIFICC=CYW43_COUNTRY_SWEDEN
rpipicowpicoprobe.menu.wificountry.switzerland=Switzerland
rpipicowpicoprobe.menu.wificountry.switzerland.build.wificc=-DWIFICC=CYW43_COUNTRY_SWITZERLAND
rpipicowpicoprobe.menu.wificountry.taiwan=Taiwan
rpipicowpicoprobe.menu.wificountry.taiwan.build.wificc=-DWIFICC=CYW43_COUNTRY_TAIWAN
rpipicowpicoprobe.menu.wificountry.thailand=Thailand
rpipicowpicoprobe.menu.wificountry.thailand.build.wificc=-DWIFICC=CYW43_COUNTRY_THAILAND
rpipicowpicoprobe.menu.wificountry.turkey=Turkey
rpipicowpicoprobe.menu.wificountry.turkey.build.wificc=-DWIFICC=CYW43_COUNTRY_TURKEY
rpipicowpicoprobe.menu.wificountry.uk=UK
rpipicowpicoprobe.menu.wificountry.uk.build.wificc=-DWIFICC=CYW43_COUNTRY_UK
rpipicowpicoprobe.menu.wificountry.usa=USA
rpipicowpicoprobe.menu.wificountry.usa.build.wificc=-DWIFICC=CYW43_COUNTRY_USA
rpipicowpicoprobe.menu.ipstack.ipv4only=IPv4 Only
rpipicowpicoprobe.menu.ipstack.ipv4only.build.libpico=libpico.a
rpipicowpicoprobe.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
rpipicowpicoprobe.menu.ipstack.ipv4ipv6=IPv4 and IPv6
rpipicowpicoprobe.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
rpipicowpicoprobe.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

