earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Raspberry Pi Pico W (pico-debug)
# -----------------------------------
rpipicowpicodebug.name=Raspberry Pi Pico W (pico-debug)
rpipicowpicodebug.vid.0=0x1209
rpipicowpicodebug.pid.0=0x2488
rpipicowpicodebug.vid.1=0x1209
rpipicowpicodebug.pid.1=0x2588
rpipicowpicodebug.vid.2=0x1209
rpipicowpicodebug.pid.2=0x6488
rpipicowpicodebug.vid.3=0x1209
rpipicowpicodebug.pid.3=0x6588
rpipicowpicodebug.vid.4=0x1209
rpipicowpicodebug.pid.4=0xa488
rpipicowpicodebug.vid.5=0x1209
rpipicowpicodebug.pid.5=0xa588
rpipicowpicodebug.vid.6=0x1209
rpipicowpicodebug.pid.6=0xe488
rpipicowpicodebug.vid.7=0x1209
rpipicowpicodebug.pid.7=0xe588
rpipicowpicodebug.build.usbpid=-DSERIALUSB_PID=0xf00a
rpipicowpicodebug.build.usbpwr=-DUSBD_MAX_POWER_MA=250
rpipicowpicodebug.build.board=RASPBERRY_PI_PICO_W
rpipicowpicodebug.build.mcu=cortex-m0plus
rpipicowpicodebug.build.variant=rpipicow
rpipicowpicodebug.upload.tool=picodebug
rpipicowpicodebug.upload.maximum_size=2097152
rpipicowpicodebug.upload.maximum_data_size=245760
rpipicowpicodebug.upload.wait_for_upload_port=true
rpipicowpicodebug.upload.erase_cmd=
rpipicowpicodebug.serial.disableDTR=false
rpipicowpicodebug.serial.disableRTS=false
rpipicowpicodebug.build.f_cpu=125000000
rpipicowpicodebug.build.led=
rpipicowpicodebug.build.core=rp2040
rpipicowpicodebug.build.ldscript=memmap_default.ld
rpipicowpicodebug.build.ram_length=240k
rpipicowpicodebug.build.debugscript=picodebug.tcl
rpipicowpicodebug.build.boot2=boot2_w25q080_2_padded_checksum
rpipicowpicodebug.build.vid=0x2e8a
rpipicowpicodebug.build.pid=0xf00a
rpipicowpicodebug.build.usb_manufacturer="Raspberry Pi"
rpipicowpicodebug.build.usb_product="Pico W (pico-debug)"
rpipicowpicodebug.menu.flash.2097152_0=2MB (no FS)
rpipicowpicodebug.menu.flash.2097152_0.upload.maximum_size=2093056
rpipicowpicodebug.menu.flash.2097152_0.build.flash_length=2093056
rpipicowpicodebug.menu.flash.2097152_0.build.eeprom_start=270528512
rpipicowpicodebug.menu.flash.2097152_0.build.fs_start=270528512
rpipicowpicodebug.menu.flash.2097152_0.build.fs_end=270528512
rpipicowpicodebug.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
rpipicowpicodebug.menu.flash.2097152_65536.upload.maximum_size=2027520
rpipicowpicodebug.menu.flash.2097152_65536.build.flash_length=2027520
rpipicowpicodebug.menu.flash.2097152_65536.build.eeprom_start=270528512
rpipicowpicodebug.menu.flash.2097152_65536.build.fs_start=270462976
rpipicowpicodebug.menu.flash.2097152_65536.build.fs_end=270528512
rpipicowpicodebug.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
rpipicowpicodebug.menu.flash.2097152_131072.upload.maximum_size=1961984
rpipicowpicodebug.menu.flash.2097152_131072.build.flash_length=1961984
rpipicowpicodebug.menu.flash.2097152_131072.build.eeprom_start=270528512
rpipicowpicodebug.menu.flash.2097152_131072.build.fs_start=270397440
rpipicowpicodebug.menu.flash.2097152_131072.build.fs_end=270528512
rpipicowpicodebug.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
rpipicowpicodebug.menu.flash.2097152_262144.upload.maximum_size=1830912
rpipicowpicodebug.menu.flash.2097152_262144.build.flash_length=1830912
rpipicowpicodebug.menu.flash.2097152_262144.build.eeprom_start=270528512
rpipicowpicodebug.menu.flash.2097152_262144.build.fs_start=270266368
rpipicowpicodebug.menu.flash.2097152_262144.build.fs_end=270528512
rpipicowpicodebug.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
rpipicowpicodebug.menu.flash.2097152_524288.upload.maximum_size=1568768
rpipicowpicodebug.menu.flash.2097152_524288.build.flash_length=1568768
rpipicowpicodebug.menu.flash.2097152_524288.build.eeprom_start=270528512
rpipicowpicodebug.menu.flash.2097152_524288.build.fs_start=270004224
rpipicowpicodebug.menu.flash.2097152_524288.build.fs_end=270528512
rpipicowpicodebug.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
rpipicowpicodebug.menu.flash.2097152_1048576.upload.maximum_size=1044480
rpipicowpicodebug.menu.flash.2097152_1048576.build.flash_length=1044480
rpipicowpicodebug.menu.flash.2097152_1048576.build.eeprom_start=270528512
rpipicowpicodebug.menu.flash.2097152_1048576.build.fs_start=269479936
rpipicowpicodebug.menu.flash.2097152_1048576.build.fs_end=270528512
rpipicowpicodebug.menu.freq.133=133 MHz
rpipicowpicodebug.menu.freq.133.build.f_cpu=133000000L
rpipicowpicodebug.menu.freq.50=50 MHz
rpipicowpicodebug.menu.freq.50.build.f_cpu=50000000L
rpipicowpicodebug.menu.freq.100=100 MHz
rpipicowpicodebug.menu.freq.100.build.f_cpu=100000000L
rpipicowpicodebug.menu.freq.120=120 MHz
rpipicowpicodebug.menu.freq.120.build.f_cpu=120000000L
rpipicowpicodebug.menu.freq.125=125 MHz
rpipicowpicodebug.menu.freq.125.build.f_cpu=125000000L
rpipicowpicodebug.menu.freq.150=150 MHz (Overclock)
rpipicowpicodebug.menu.freq.150.build.f_cpu=150000000L
rpipicowpicodebug.menu.freq.175=175 MHz (Overclock)
rpipicowpicodebug.menu.freq.175.build.f_cpu=175000000L
rpipicowpicodebug.menu.freq.200=200 MHz (Overclock)
rpipicowpicodebug.menu.freq.200.build.f_cpu=200000000L
rpipicowpicodebug.menu.freq.225=225 MHz (Overclock)
rpipicowpicodebug.menu.freq.225.build.f_cpu=225000000L
rpipicowpicodebug.menu.freq.240=240 MHz (Overclock)
rpipicowpicodebug.menu.freq.240.build.f_cpu=240000000L
rpipicowpicodebug.menu.freq.250=250 MHz (Overclock)
rpipicowpicodebug.menu.freq.250.build.f_cpu=250000000L
rpipicowpicodebug.menu.freq.275=275 MHz (Overclock)
rpipicowpicodebug.menu.freq.275.build.f_cpu=275000000L
rpipicowpicodebug.menu.freq.300=300 MHz (Overclock)
rpipicowpicodebug.menu.freq.300.build.f_cpu=300000000L
rpipicowpicodebug.menu.opt.Small=Small (-Os) (standard)
rpipicowpicodebug.menu.opt.Small.build.flags.optimize=-Os
rpipicowpicodebug.menu.opt.Optimize=Optimize (-O)
rpipicowpicodebug.menu.opt.Optimize.build.flags.optimize=-O
rpipicowpicodebug.menu.opt.Optimize2=Optimize More (-O2)
rpipicowpicodebug.menu.opt.Optimize2.build.flags.optimize=-O2
rpipicowpicodebug.menu.opt.Optimize3=Optimize Even More (-O3)
rpipicowpicodebug.menu.opt.Optimize3.build.flags.optimize=-O3
rpipicowpicodebug.menu.opt.Fast=Fast (-Ofast) (maybe slower)
rpipicowpicodebug.menu.opt.Fast.build.flags.optimize=-Ofast
rpipicowpicodebug.menu.opt.Debug=Debug (-Og)
rpipicowpicodebug.menu.opt.Debug.build.flags.optimize=-Og
rpipicowpicodebug.menu.rtti.Disabled=Disabled
rpipicowpicodebug.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
rpipicowpicodebug.menu.rtti.Enabled=Enabled
rpipicowpicodebug.menu.rtti.Enabled.build.flags.rtti=
rpipicowpicodebug.menu.stackprotect.Disabled=Disabled
rpipicowpicodebug.menu.stackprotect.Disabled.build.flags.stackprotect=
rpipicowpicodebug.menu.stackprotect.Enabled=Enabled
rpipicowpicodebug.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
rpipicowpicodebug.menu.exceptions.Disabled=Disabled
rpipicowpicodebug.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
rpipicowpicodebug.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
rpipicowpicodebug.menu.exceptions.Enabled=Enabled
rpipicowpicodebug.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
rpipicowpicodebug.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
rpipicowpicodebug.menu.dbgport.Disabled=Disabled
rpipicowpicodebug.menu.dbgport.Disabled.build.debug_port=
rpipicowpicodebug.menu.dbgport.Serial=Serial
rpipicowpicodebug.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
rpipicowpicodebug.menu.dbgport.Serial1=Serial1
rpipicowpicodebug.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
rpipicowpicodebug.menu.dbgport.Serial2=Serial2
rpipicowpicodebug.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
rpipicowpicodebug.menu.dbglvl.None=None
rpipicowpicodebug.menu.dbglvl.None.build.debug_level=
rpipicowpicodebug.menu.dbglvl.Core=Core
rpipicowpicodebug.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
rpipicowpicodebug.menu.dbglvl.SPI=SPI
rpipicowpicodebug.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
rpipicowpicodebug.menu.dbglvl.Wire=Wire
rpipicowpicodebug.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
rpipicowpicodebug.menu.dbglvl.All=All
rpipicowpicodebug.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
rpipicowpicodebug.menu.dbglvl.NDEBUG=NDEBUG
rpipicowpicodebug.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
rpipicowpicodebug.menu.usbstack.nousb=No USB
rpipicowpicodebug.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
rpipicowpicodebug.menu.wificountry.worldwide=Worldwide
rpipicowpicodebug.menu.wificountry.worldwide.build.wificc=-DWIFICC=CYW43_COUNTRY_WORLDWIDE
rpipicowpicodebug.menu.wificountry.australia=Australia
rpipicowpicodebug.menu.wificountry.australia.build.wificc=-DWIFICC=CYW43_COUNTRY_AUSTRALIA
rpipicowpicodebug.menu.wificountry.austria=Austria
rpipicowpicodebug.menu.wificountry.austria.build.wificc=-DWIFICC=CYW43_COUNTRY_AUSTRIA
rpipicowpicodebug.menu.wificountry.belgium=Belgium
rpipicowpicodebug.menu.wificountry.belgium.build.wificc=-DWIFICC=CYW43_COUNTRY_BELGIUM
rpipicowpicodebug.menu.wificountry.brazil=Brazil
rpipicowpicodebug.menu.wificountry.brazil.build.wificc=-DWIFICC=CYW43_COUNTRY_BRAZIL
rpipicowpicodebug.menu.wificountry.canada=Canada
rpipicowpicodebug.menu.wificountry.canada.build.wificc=-DWIFICC=CYW43_COUNTRY_CANADA
rpipicowpicodebug.menu.wificountry.chile=Chile
rpipicowpicodebug.menu.wificountry.chile.build.wificc=-DWIFICC=CYW43_COUNTRY_CHILE
rpipicowpicodebug.menu.wificountry.china=China
rpipicowpicodebug.menu.wificountry.china.build.wificc=-DWIFICC=CYW43_COUNTRY_CHINA
rpipicowpicodebug.menu.wificountry.colombia=Colombia
rpipicowpicodebug.menu.wificountry.colombia.build.wificc=-DWIFICC=CYW43_COUNTRY_COLOMBIA
rpipicowpicodebug.menu.wificountry.czech_republic=Czech Republic
rpipicowpicodebug.menu.wificountry.czech_republic.build.wificc=-DWIFICC=CYW43_COUNTRY_CZECH_REPUBLIC
rpipicowpicodebug.menu.wificountry.denmark=Denmark
rpipicowpicodebug.menu.wificountry.denmark.build.wificc=-DWIFICC=CYW43_COUNTRY_DENMARK
rpipicowpicodebug.menu.wificountry.estonia=Estonia
rpipicowpicodebug.menu.wificountry.estonia.build.wificc=-DWIFICC=CYW43_COUNTRY_ESTONIA
rpipicowpicodebug.menu.wificountry.finland=Finland
rpipicowpicodebug.menu.wificountry.finland.build.wificc=-DWIFICC=CYW43_COUNTRY_FINLAND
rpipicowpicodebug.menu.wificountry.france=France
rpipicowpicodebug.menu.wificountry.france.build.wificc=-DWIFICC=CYW43_COUNTRY_FRANCE
rpipicowpicodebug.menu.wificountry.germany=Germany
rpipicowpicodebug.menu.wificountry.germany.build.wificc=-DWIFICC=CYW43_COUNTRY_GERMANY
rpipicowpicodebug.menu.wificountry.greece=Greece
rpipicowpicodebug.menu.wificountry.greece.build.wificc=-DWIFICC=CYW43_COUNTRY_GREECE
rpipicowpicodebug.menu.wificountry.hong_kong=Hong Kong
rpipicowpicodebug.menu.wificountry.hong_kong.build.wificc=-DWIFICC=CYW43_COUNTRY_HONG_KONG
rpipicowpicodebug.menu.wificountry.hungary=Hungary
rpipicowpicodebug.menu.wificountry.hungary.build.wificc=-DWIFICC=CYW43_COUNTRY_HUNGARY
rpipicowpicodebug.menu.wificountry.iceland=Iceland
rpipicowpicodebug.menu.wificountry.iceland.build.wificc=-DWIFICC=CYW43_COUNTRY_ICELAND
rpipicowpicodebug.menu.wificountry.india=India
rpipicowpicodebug.menu.wificountry.india.build.wificc=-DWIFICC=CYW43_COUNTRY_INDIA
rpipicowpicodebug.menu.wificountry.israel=Israel
rpipicowpicodebug.menu.wificountry.israel.build.wificc=-DWIFICC=CYW43_COUNTRY_ISRAEL
rpipicowpicodebug.menu.wificountry.italy=Italy
rpipicowpicodebug.menu.wificountry.italy.build.wificc=-DWIFICC=CYW43_COUNTRY_ITALY
rpipicowpicodebug.menu.wificountry.japan=Japan
rpipicowpicodebug.menu.wificountry.japan.build.wificc=-DWIFICC=CYW43_COUNTRY_JAPAN
rpipicowpicodebug.menu.wificountry.kenya=Kenya
rpipicowpicodebug.menu.wificountry.kenya.build.wificc=-DWIFICC=CYW43_COUNTRY_KENYA
rpipicowpicodebug.menu.wificountry.latvia=Latvia
rpipicowpicodebug.menu.wificountry.latvia.build.wificc=-DWIFICC=CYW43_COUNTRY_LATVIA
rpipicowpicodebug.menu.wificountry.liechtenstein=Liechtenstein
rpipicowpicodebug.menu.wificountry.liechtenstein.build.wificc=-DWIFICC=CYW43_COUNTRY_LIECHTENSTEIN
rpipicowpicodebug.menu.wificountry.lithuania=Lithuania
rpipicowpicodebug.menu.wificountry.lithuania.build.wificc=-DWIFICC=CYW43_COUNTRY_LITHUANIA
rpipicowpicodebug.menu.wificountry.luxembourg=Luxembourg
rpipicowpicodebug.menu.wificountry.luxembourg.build.wificc=-DWIFICC=CYW43_COUNTRY_LUXEMBOURG
rpipicowpicodebug.menu.wificountry.malaysia=Malaysia
rpipicowpicodebug.menu.wificountry.malaysia.build.wificc=-DWIFICC=CYW43_COUNTRY_MALAYSIA
rpipicowpicodebug.menu.wificountry.malta=Malta
rpipicowpicodebug.menu.wificountry.malta.build.wificc=-DWIFICC=CYW43_COUNTRY_MALTA
rpipicowpicodebug.menu.wificountry.mexico=Mexico
rpipicowpicodebug.menu.wificountry.mexico.build.wificc=-DWIFICC=CYW43_COUNTRY_MEXICO
rpipicowpicodebug.menu.wificountry.netherlands=Netherlands
rpipicowpicodebug.menu.wificountry.netherlands.build.wificc=-DWIFICC=CYW43_COUNTRY_NETHERLANDS
rpipicowpicodebug.menu.wificountry.new_zealand=New Zealand
rpipicowpicodebug.menu.wificountry.new_zealand.build.wificc=-DWIFICC=CYW43_COUNTRY_NEW_ZEALAND
rpipicowpicodebug.menu.wificountry.nigeria=Nigeria
rpipicowpicodebug.menu.wificountry.nigeria.build.wificc=-DWIFICC=CYW43_COUNTRY_NIGERIA
rpipicowpicodebug.menu.wificountry.norway=Norway
rpipicowpicodebug.menu.wificountry.norway.build.wificc=-DWIFICC=CYW43_COUNTRY_NORWAY
rpipicowpicodebug.menu.wificountry.peru=Peru
rpipicowpicodebug.menu.wificountry.peru.build.wificc=-DWIFICC=CYW43_COUNTRY_PERU
rpipicowpicodebug.menu.wificountry.philippines=Philippines
rpipicowpicodebug.menu.wificountry.philippines.build.wificc=-DWIFICC=CYW43_COUNTRY_PHILIPPINES
rpipicowpicodebug.menu.wificountry.poland=Poland
rpipicowpicodebug.menu.wificountry.poland.build.wificc=-DWIFICC=CYW43_COUNTRY_POLAND
rpipicowpicodebug.menu.wificountry.portugal=Portugal
rpipicowpicodebug.menu.wificountry.portugal.build.wificc=-DWIFICC=CYW43_COUNTRY_PORTUGAL
rpipicowpicodebug.menu.wificountry.singapore=Singapore
rpipicowpicodebug.menu.wificountry.singapore.build.wificc=-DWIFICC=CYW43_COUNTRY_SINGAPORE
rpipicowpicodebug.menu.wificountry.slovakia=Slovakia
rpipicowpicodebug.menu.wificountry.slovakia.build.wificc=-DWIFICC=CYW43_COUNTRY_SLOVAKIA
rpipicowpicodebug.menu.wificountry.slovenia=Slovenia
rpipicowpicodebug.menu.wificountry.slovenia.build.wificc=-DWIFICC=CYW43_COUNTRY_SLOVENIA
rpipicowpicodebug.menu.wificountry.south_africa=South Africa
rpipicowpicodebug.menu.wificountry.south_africa.build.wificc=-DWIFICC=CYW43_COUNTRY_SOUTH_AFRICA
rpipicowpicodebug.menu.wificountry.south_korea=South Korea
rpipicowpicodebug.menu.wificountry.south_korea.build.wificc=-DWIFICC=CYW43_COUNTRY_SOUTH_KOREA
rpipicowpicodebug.menu.wificountry.spain=Spain
rpipicowpicodebug.menu.wificountry.spain.build.wificc=-DWIFICC=CYW43_COUNTRY_SPAIN
rpipicowpicodebug.menu.wificountry.sweden=Sweden
rpipicowpicodebug.menu.wificountry.sweden.build.wificc=-DWIFICC=CYW43_COUNTRY_SWEDEN
rpipicowpicodebug.menu.wificountry.switzerland=Switzerland
rpipicowpicodebug.menu.wificountry.switzerland.build.wificc=-DWIFICC=CYW43_COUNTRY_SWITZERLAND
rpipicowpicodebug.menu.wificountry.taiwan=Taiwan
rpipicowpicodebug.menu.wificountry.taiwan.build.wificc=-DWIFICC=CYW43_COUNTRY_TAIWAN
rpipicowpicodebug.menu.wificountry.thailand=Thailand
rpipicowpicodebug.menu.wificountry.thailand.build.wificc=-DWIFICC=CYW43_COUNTRY_THAILAND
rpipicowpicodebug.menu.wificountry.turkey=Turkey
rpipicowpicodebug.menu.wificountry.turkey.build.wificc=-DWIFICC=CYW43_COUNTRY_TURKEY
rpipicowpicodebug.menu.wificountry.uk=UK
rpipicowpicodebug.menu.wificountry.uk.build.wificc=-DWIFICC=CYW43_COUNTRY_UK
rpipicowpicodebug.menu.wificountry.usa=USA
rpipicowpicodebug.menu.wificountry.usa.build.wificc=-DWIFICC=CYW43_COUNTRY_USA
rpipicowpicodebug.menu.ipstack.ipv4only=IPv4 Only
rpipicowpicodebug.menu.ipstack.ipv4only.build.libpico=libpico.a
rpipicowpicodebug.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
rpipicowpicodebug.menu.ipstack.ipv4ipv6=IPv4 and IPv6
rpipicowpicodebug.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
rpipicowpicodebug.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

