earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# BridgeTek IDM2040-7A (pico-debug)
# -----------------------------------
bridgetek_idm2040-7apicodebug.name=BridgeTek IDM2040-7A (pico-debug)
bridgetek_idm2040-7apicodebug.vid.0=0x1209
bridgetek_idm2040-7apicodebug.pid.0=0x2488
bridgetek_idm2040-7apicodebug.vid.1=0x1209
bridgetek_idm2040-7apicodebug.pid.1=0x2588
bridgetek_idm2040-7apicodebug.vid.2=0x1209
bridgetek_idm2040-7apicodebug.pid.2=0x6488
bridgetek_idm2040-7apicodebug.vid.3=0x1209
bridgetek_idm2040-7apicodebug.pid.3=0x6588
bridgetek_idm2040-7apicodebug.vid.4=0x1209
bridgetek_idm2040-7apicodebug.pid.4=0xa488
bridgetek_idm2040-7apicodebug.vid.5=0x1209
bridgetek_idm2040-7apicodebug.pid.5=0xa588
bridgetek_idm2040-7apicodebug.vid.6=0x1209
bridgetek_idm2040-7apicodebug.pid.6=0xe488
bridgetek_idm2040-7apicodebug.vid.7=0x1209
bridgetek_idm2040-7apicodebug.pid.7=0xe588
bridgetek_idm2040-7apicodebug.build.usbpid=-DSERIALUSB_PID=0x1041
bridgetek_idm2040-7apicodebug.build.usbpwr=-DUSBD_MAX_POWER_MA=250
bridgetek_idm2040-7apicodebug.build.board=BRIDGETEK_IDM2040-7A
bridgetek_idm2040-7apicodebug.build.mcu=cortex-m0plus
bridgetek_idm2040-7apicodebug.build.variant=bridgetek_idm2040-7a
bridgetek_idm2040-7apicodebug.upload.tool=picodebug
bridgetek_idm2040-7apicodebug.upload.maximum_size=8388608
bridgetek_idm2040-7apicodebug.upload.maximum_data_size=245760
bridgetek_idm2040-7apicodebug.upload.wait_for_upload_port=true
bridgetek_idm2040-7apicodebug.upload.erase_cmd=
bridgetek_idm2040-7apicodebug.serial.disableDTR=false
bridgetek_idm2040-7apicodebug.serial.disableRTS=false
bridgetek_idm2040-7apicodebug.build.f_cpu=125000000
bridgetek_idm2040-7apicodebug.build.led=
bridgetek_idm2040-7apicodebug.build.core=rp2040
bridgetek_idm2040-7apicodebug.build.ldscript=memmap_default.ld
bridgetek_idm2040-7apicodebug.build.ram_length=240k
bridgetek_idm2040-7apicodebug.build.debugscript=picodebug.tcl
bridgetek_idm2040-7apicodebug.build.boot2=boot2_w25q080_2_padded_checksum
bridgetek_idm2040-7apicodebug.build.vid=0x2e8a
bridgetek_idm2040-7apicodebug.build.pid=0x1041
bridgetek_idm2040-7apicodebug.build.usb_manufacturer="BridgeTek"
bridgetek_idm2040-7apicodebug.build.usb_product="IDM2040-7A (pico-debug)"
bridgetek_idm2040-7apicodebug.build.extra_flags=-DFT8XX_TYPE=BT817 -DDISPLAY_RES=WVGA -DPLATFORM_RP2040
bridgetek_idm2040-7apicodebug.menu.flash.8388608_0=8MB (no FS)
bridgetek_idm2040-7apicodebug.menu.flash.8388608_0.upload.maximum_size=8384512
bridgetek_idm2040-7apicodebug.menu.flash.8388608_0.build.flash_length=8384512
bridgetek_idm2040-7apicodebug.menu.flash.8388608_0.build.eeprom_start=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_0.build.fs_start=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_0.build.fs_end=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_65536=8MB (Sketch: 8128KB, FS: 64KB)
bridgetek_idm2040-7apicodebug.menu.flash.8388608_65536.upload.maximum_size=8318976
bridgetek_idm2040-7apicodebug.menu.flash.8388608_65536.build.flash_length=8318976
bridgetek_idm2040-7apicodebug.menu.flash.8388608_65536.build.eeprom_start=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_65536.build.fs_start=276754432
bridgetek_idm2040-7apicodebug.menu.flash.8388608_65536.build.fs_end=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_131072=8MB (Sketch: 8064KB, FS: 128KB)
bridgetek_idm2040-7apicodebug.menu.flash.8388608_131072.upload.maximum_size=8253440
bridgetek_idm2040-7apicodebug.menu.flash.8388608_131072.build.flash_length=8253440
bridgetek_idm2040-7apicodebug.menu.flash.8388608_131072.build.eeprom_start=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_131072.build.fs_start=276688896
bridgetek_idm2040-7apicodebug.menu.flash.8388608_131072.build.fs_end=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_262144=8MB (Sketch: 7936KB, FS: 256KB)
bridgetek_idm2040-7apicodebug.menu.flash.8388608_262144.upload.maximum_size=8122368
bridgetek_idm2040-7apicodebug.menu.flash.8388608_262144.build.flash_length=8122368
bridgetek_idm2040-7apicodebug.menu.flash.8388608_262144.build.eeprom_start=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_262144.build.fs_start=276557824
bridgetek_idm2040-7apicodebug.menu.flash.8388608_262144.build.fs_end=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_524288=8MB (Sketch: 7680KB, FS: 512KB)
bridgetek_idm2040-7apicodebug.menu.flash.8388608_524288.upload.maximum_size=7860224
bridgetek_idm2040-7apicodebug.menu.flash.8388608_524288.build.flash_length=7860224
bridgetek_idm2040-7apicodebug.menu.flash.8388608_524288.build.eeprom_start=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_524288.build.fs_start=276295680
bridgetek_idm2040-7apicodebug.menu.flash.8388608_524288.build.fs_end=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_1048576=8MB (Sketch: 7MB, FS: 1MB)
bridgetek_idm2040-7apicodebug.menu.flash.8388608_1048576.upload.maximum_size=7335936
bridgetek_idm2040-7apicodebug.menu.flash.8388608_1048576.build.flash_length=7335936
bridgetek_idm2040-7apicodebug.menu.flash.8388608_1048576.build.eeprom_start=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_1048576.build.fs_start=275771392
bridgetek_idm2040-7apicodebug.menu.flash.8388608_1048576.build.fs_end=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
bridgetek_idm2040-7apicodebug.menu.flash.8388608_2097152.upload.maximum_size=6287360
bridgetek_idm2040-7apicodebug.menu.flash.8388608_2097152.build.flash_length=6287360
bridgetek_idm2040-7apicodebug.menu.flash.8388608_2097152.build.eeprom_start=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_2097152.build.fs_start=274722816
bridgetek_idm2040-7apicodebug.menu.flash.8388608_2097152.build.fs_end=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_3145728=8MB (Sketch: 5MB, FS: 3MB)
bridgetek_idm2040-7apicodebug.menu.flash.8388608_3145728.upload.maximum_size=5238784
bridgetek_idm2040-7apicodebug.menu.flash.8388608_3145728.build.flash_length=5238784
bridgetek_idm2040-7apicodebug.menu.flash.8388608_3145728.build.eeprom_start=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_3145728.build.fs_start=273674240
bridgetek_idm2040-7apicodebug.menu.flash.8388608_3145728.build.fs_end=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
bridgetek_idm2040-7apicodebug.menu.flash.8388608_4194304.upload.maximum_size=4190208
bridgetek_idm2040-7apicodebug.menu.flash.8388608_4194304.build.flash_length=4190208
bridgetek_idm2040-7apicodebug.menu.flash.8388608_4194304.build.eeprom_start=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_4194304.build.fs_start=272625664
bridgetek_idm2040-7apicodebug.menu.flash.8388608_4194304.build.fs_end=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_5242880=8MB (Sketch: 3MB, FS: 5MB)
bridgetek_idm2040-7apicodebug.menu.flash.8388608_5242880.upload.maximum_size=3141632
bridgetek_idm2040-7apicodebug.menu.flash.8388608_5242880.build.flash_length=3141632
bridgetek_idm2040-7apicodebug.menu.flash.8388608_5242880.build.eeprom_start=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_5242880.build.fs_start=271577088
bridgetek_idm2040-7apicodebug.menu.flash.8388608_5242880.build.fs_end=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_6291456=8MB (Sketch: 2MB, FS: 6MB)
bridgetek_idm2040-7apicodebug.menu.flash.8388608_6291456.upload.maximum_size=2093056
bridgetek_idm2040-7apicodebug.menu.flash.8388608_6291456.build.flash_length=2093056
bridgetek_idm2040-7apicodebug.menu.flash.8388608_6291456.build.eeprom_start=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_6291456.build.fs_start=270528512
bridgetek_idm2040-7apicodebug.menu.flash.8388608_6291456.build.fs_end=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
bridgetek_idm2040-7apicodebug.menu.flash.8388608_7340032.upload.maximum_size=1044480
bridgetek_idm2040-7apicodebug.menu.flash.8388608_7340032.build.flash_length=1044480
bridgetek_idm2040-7apicodebug.menu.flash.8388608_7340032.build.eeprom_start=276819968
bridgetek_idm2040-7apicodebug.menu.flash.8388608_7340032.build.fs_start=269479936
bridgetek_idm2040-7apicodebug.menu.flash.8388608_7340032.build.fs_end=276819968
bridgetek_idm2040-7apicodebug.menu.freq.133=133 MHz
bridgetek_idm2040-7apicodebug.menu.freq.133.build.f_cpu=133000000L
bridgetek_idm2040-7apicodebug.menu.freq.50=50 MHz
bridgetek_idm2040-7apicodebug.menu.freq.50.build.f_cpu=50000000L
bridgetek_idm2040-7apicodebug.menu.freq.100=100 MHz
bridgetek_idm2040-7apicodebug.menu.freq.100.build.f_cpu=100000000L
bridgetek_idm2040-7apicodebug.menu.freq.120=120 MHz
bridgetek_idm2040-7apicodebug.menu.freq.120.build.f_cpu=120000000L
bridgetek_idm2040-7apicodebug.menu.freq.125=125 MHz
bridgetek_idm2040-7apicodebug.menu.freq.125.build.f_cpu=125000000L
bridgetek_idm2040-7apicodebug.menu.freq.150=150 MHz (Overclock)
bridgetek_idm2040-7apicodebug.menu.freq.150.build.f_cpu=150000000L
bridgetek_idm2040-7apicodebug.menu.freq.175=175 MHz (Overclock)
bridgetek_idm2040-7apicodebug.menu.freq.175.build.f_cpu=175000000L
bridgetek_idm2040-7apicodebug.menu.freq.200=200 MHz (Overclock)
bridgetek_idm2040-7apicodebug.menu.freq.200.build.f_cpu=200000000L
bridgetek_idm2040-7apicodebug.menu.freq.225=225 MHz (Overclock)
bridgetek_idm2040-7apicodebug.menu.freq.225.build.f_cpu=225000000L
bridgetek_idm2040-7apicodebug.menu.freq.240=240 MHz (Overclock)
bridgetek_idm2040-7apicodebug.menu.freq.240.build.f_cpu=240000000L
bridgetek_idm2040-7apicodebug.menu.freq.250=250 MHz (Overclock)
bridgetek_idm2040-7apicodebug.menu.freq.250.build.f_cpu=250000000L
bridgetek_idm2040-7apicodebug.menu.freq.275=275 MHz (Overclock)
bridgetek_idm2040-7apicodebug.menu.freq.275.build.f_cpu=275000000L
bridgetek_idm2040-7apicodebug.menu.freq.300=300 MHz (Overclock)
bridgetek_idm2040-7apicodebug.menu.freq.300.build.f_cpu=300000000L
bridgetek_idm2040-7apicodebug.menu.opt.Small=Small (-Os) (standard)
bridgetek_idm2040-7apicodebug.menu.opt.Small.build.flags.optimize=-Os
bridgetek_idm2040-7apicodebug.menu.opt.Optimize=Optimize (-O)
bridgetek_idm2040-7apicodebug.menu.opt.Optimize.build.flags.optimize=-O
bridgetek_idm2040-7apicodebug.menu.opt.Optimize2=Optimize More (-O2)
bridgetek_idm2040-7apicodebug.menu.opt.Optimize2.build.flags.optimize=-O2
bridgetek_idm2040-7apicodebug.menu.opt.Optimize3=Optimize Even More (-O3)
bridgetek_idm2040-7apicodebug.menu.opt.Optimize3.build.flags.optimize=-O3
bridgetek_idm2040-7apicodebug.menu.opt.Fast=Fast (-Ofast) (maybe slower)
bridgetek_idm2040-7apicodebug.menu.opt.Fast.build.flags.optimize=-Ofast
bridgetek_idm2040-7apicodebug.menu.opt.Debug=Debug (-Og)
bridgetek_idm2040-7apicodebug.menu.opt.Debug.build.flags.optimize=-Og
bridgetek_idm2040-7apicodebug.menu.rtti.Disabled=Disabled
bridgetek_idm2040-7apicodebug.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
bridgetek_idm2040-7apicodebug.menu.rtti.Enabled=Enabled
bridgetek_idm2040-7apicodebug.menu.rtti.Enabled.build.flags.rtti=
bridgetek_idm2040-7apicodebug.menu.stackprotect.Disabled=Disabled
bridgetek_idm2040-7apicodebug.menu.stackprotect.Disabled.build.flags.stackprotect=
bridgetek_idm2040-7apicodebug.menu.stackprotect.Enabled=Enabled
bridgetek_idm2040-7apicodebug.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
bridgetek_idm2040-7apicodebug.menu.exceptions.Disabled=Disabled
bridgetek_idm2040-7apicodebug.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
bridgetek_idm2040-7apicodebug.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
bridgetek_idm2040-7apicodebug.menu.exceptions.Enabled=Enabled
bridgetek_idm2040-7apicodebug.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
bridgetek_idm2040-7apicodebug.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
bridgetek_idm2040-7apicodebug.menu.dbgport.Disabled=Disabled
bridgetek_idm2040-7apicodebug.menu.dbgport.Disabled.build.debug_port=
bridgetek_idm2040-7apicodebug.menu.dbgport.Serial=Serial
bridgetek_idm2040-7apicodebug.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
bridgetek_idm2040-7apicodebug.menu.dbgport.Serial1=Serial1
bridgetek_idm2040-7apicodebug.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
bridgetek_idm2040-7apicodebug.menu.dbgport.Serial2=Serial2
bridgetek_idm2040-7apicodebug.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
bridgetek_idm2040-7apicodebug.menu.dbglvl.None=None
bridgetek_idm2040-7apicodebug.menu.dbglvl.None.build.debug_level=
bridgetek_idm2040-7apicodebug.menu.dbglvl.Core=Core
bridgetek_idm2040-7apicodebug.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
bridgetek_idm2040-7apicodebug.menu.dbglvl.SPI=SPI
bridgetek_idm2040-7apicodebug.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
bridgetek_idm2040-7apicodebug.menu.dbglvl.Wire=Wire
bridgetek_idm2040-7apicodebug.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
bridgetek_idm2040-7apicodebug.menu.dbglvl.All=All
bridgetek_idm2040-7apicodebug.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
bridgetek_idm2040-7apicodebug.menu.dbglvl.NDEBUG=NDEBUG
bridgetek_idm2040-7apicodebug.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
bridgetek_idm2040-7apicodebug.menu.usbstack.nousb=No USB
bridgetek_idm2040-7apicodebug.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
bridgetek_idm2040-7apicodebug.menu.ipstack.ipv4only=IPv4 Only
bridgetek_idm2040-7apicodebug.menu.ipstack.ipv4only.build.libpico=libpico.a
bridgetek_idm2040-7apicodebug.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
bridgetek_idm2040-7apicodebug.menu.ipstack.ipv4ipv6=IPv4 and IPv6
bridgetek_idm2040-7apicodebug.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
bridgetek_idm2040-7apicodebug.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

