earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Degz Mizu
# -----------------------------------
degz_mizu.name=Degz Mizu
degz_mizu.vid.0=0x2e8a
degz_mizu.pid.0=0x000a
degz_mizu.vid.1=0x2e8a
degz_mizu.pid.1=0x010a
degz_mizu.vid.2=0x2e8a
degz_mizu.pid.2=0x400a
degz_mizu.vid.3=0x2e8a
degz_mizu.pid.3=0x410a
degz_mizu.vid.4=0x2e8a
degz_mizu.pid.4=0x800a
degz_mizu.vid.5=0x2e8a
degz_mizu.pid.5=0x810a
degz_mizu.vid.6=0x2e8a
degz_mizu.pid.6=0xc00a
degz_mizu.vid.7=0x2e8a
degz_mizu.pid.7=0xc10a
degz_mizu.build.usbpid=-DSERIALUSB_PID=0x000a
degz_mizu.build.usbpwr=-DUSBD_MAX_POWER_MA=250
degz_mizu.build.board=DEGZ_MIZU
degz_mizu.build.mcu=cortex-m0plus
degz_mizu.build.variant=degz_mizu
degz_mizu.upload.tool=uf2conv
degz_mizu.upload.maximum_size=8388608
degz_mizu.upload.maximum_data_size=262144
degz_mizu.upload.wait_for_upload_port=true
degz_mizu.upload.erase_cmd=
degz_mizu.serial.disableDTR=false
degz_mizu.serial.disableRTS=false
degz_mizu.build.f_cpu=125000000
degz_mizu.build.led=
degz_mizu.build.core=rp2040
degz_mizu.build.ldscript=memmap_default.ld
degz_mizu.build.ram_length=256k
degz_mizu.build.debugscript=picoprobe.tcl
degz_mizu.build.boot2=boot2_generic_03h_4_padded_checksum
degz_mizu.build.vid=0x2e8a
degz_mizu.build.pid=0x000a
degz_mizu.build.usb_manufacturer="Degz"
degz_mizu.build.usb_product="Mizu"
degz_mizu.menu.flash.8388608_0=8MB (no FS)
degz_mizu.menu.flash.8388608_0.upload.maximum_size=8384512
degz_mizu.menu.flash.8388608_0.build.flash_length=8384512
degz_mizu.menu.flash.8388608_0.build.eeprom_start=276819968
degz_mizu.menu.flash.8388608_0.build.fs_start=276819968
degz_mizu.menu.flash.8388608_0.build.fs_end=276819968
degz_mizu.menu.flash.8388608_65536=8MB (Sketch: 8128KB, FS: 64KB)
degz_mizu.menu.flash.8388608_65536.upload.maximum_size=8318976
degz_mizu.menu.flash.8388608_65536.build.flash_length=8318976
degz_mizu.menu.flash.8388608_65536.build.eeprom_start=276819968
degz_mizu.menu.flash.8388608_65536.build.fs_start=276754432
degz_mizu.menu.flash.8388608_65536.build.fs_end=276819968
degz_mizu.menu.flash.8388608_131072=8MB (Sketch: 8064KB, FS: 128KB)
degz_mizu.menu.flash.8388608_131072.upload.maximum_size=8253440
degz_mizu.menu.flash.8388608_131072.build.flash_length=8253440
degz_mizu.menu.flash.8388608_131072.build.eeprom_start=276819968
degz_mizu.menu.flash.8388608_131072.build.fs_start=276688896
degz_mizu.menu.flash.8388608_131072.build.fs_end=276819968
degz_mizu.menu.flash.8388608_262144=8MB (Sketch: 7936KB, FS: 256KB)
degz_mizu.menu.flash.8388608_262144.upload.maximum_size=8122368
degz_mizu.menu.flash.8388608_262144.build.flash_length=8122368
degz_mizu.menu.flash.8388608_262144.build.eeprom_start=276819968
degz_mizu.menu.flash.8388608_262144.build.fs_start=276557824
degz_mizu.menu.flash.8388608_262144.build.fs_end=276819968
degz_mizu.menu.flash.8388608_524288=8MB (Sketch: 7680KB, FS: 512KB)
degz_mizu.menu.flash.8388608_524288.upload.maximum_size=7860224
degz_mizu.menu.flash.8388608_524288.build.flash_length=7860224
degz_mizu.menu.flash.8388608_524288.build.eeprom_start=276819968
degz_mizu.menu.flash.8388608_524288.build.fs_start=276295680
degz_mizu.menu.flash.8388608_524288.build.fs_end=276819968
degz_mizu.menu.flash.8388608_1048576=8MB (Sketch: 7MB, FS: 1MB)
degz_mizu.menu.flash.8388608_1048576.upload.maximum_size=7335936
degz_mizu.menu.flash.8388608_1048576.build.flash_length=7335936
degz_mizu.menu.flash.8388608_1048576.build.eeprom_start=276819968
degz_mizu.menu.flash.8388608_1048576.build.fs_start=275771392
degz_mizu.menu.flash.8388608_1048576.build.fs_end=276819968
degz_mizu.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
degz_mizu.menu.flash.8388608_2097152.upload.maximum_size=6287360
degz_mizu.menu.flash.8388608_2097152.build.flash_length=6287360
degz_mizu.menu.flash.8388608_2097152.build.eeprom_start=276819968
degz_mizu.menu.flash.8388608_2097152.build.fs_start=274722816
degz_mizu.menu.flash.8388608_2097152.build.fs_end=276819968
degz_mizu.menu.flash.8388608_3145728=8MB (Sketch: 5MB, FS: 3MB)
degz_mizu.menu.flash.8388608_3145728.upload.maximum_size=5238784
degz_mizu.menu.flash.8388608_3145728.build.flash_length=5238784
degz_mizu.menu.flash.8388608_3145728.build.eeprom_start=276819968
degz_mizu.menu.flash.8388608_3145728.build.fs_start=273674240
degz_mizu.menu.flash.8388608_3145728.build.fs_end=276819968
degz_mizu.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
degz_mizu.menu.flash.8388608_4194304.upload.maximum_size=4190208
degz_mizu.menu.flash.8388608_4194304.build.flash_length=4190208
degz_mizu.menu.flash.8388608_4194304.build.eeprom_start=276819968
degz_mizu.menu.flash.8388608_4194304.build.fs_start=272625664
degz_mizu.menu.flash.8388608_4194304.build.fs_end=276819968
degz_mizu.menu.flash.8388608_5242880=8MB (Sketch: 3MB, FS: 5MB)
degz_mizu.menu.flash.8388608_5242880.upload.maximum_size=3141632
degz_mizu.menu.flash.8388608_5242880.build.flash_length=3141632
degz_mizu.menu.flash.8388608_5242880.build.eeprom_start=276819968
degz_mizu.menu.flash.8388608_5242880.build.fs_start=271577088
degz_mizu.menu.flash.8388608_5242880.build.fs_end=276819968
degz_mizu.menu.flash.8388608_6291456=8MB (Sketch: 2MB, FS: 6MB)
degz_mizu.menu.flash.8388608_6291456.upload.maximum_size=2093056
degz_mizu.menu.flash.8388608_6291456.build.flash_length=2093056
degz_mizu.menu.flash.8388608_6291456.build.eeprom_start=276819968
degz_mizu.menu.flash.8388608_6291456.build.fs_start=270528512
degz_mizu.menu.flash.8388608_6291456.build.fs_end=276819968
degz_mizu.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
degz_mizu.menu.flash.8388608_7340032.upload.maximum_size=1044480
degz_mizu.menu.flash.8388608_7340032.build.flash_length=1044480
degz_mizu.menu.flash.8388608_7340032.build.eeprom_start=276819968
degz_mizu.menu.flash.8388608_7340032.build.fs_start=269479936
degz_mizu.menu.flash.8388608_7340032.build.fs_end=276819968
degz_mizu.menu.freq.133=133 MHz
degz_mizu.menu.freq.133.build.f_cpu=133000000L
degz_mizu.menu.freq.50=50 MHz
degz_mizu.menu.freq.50.build.f_cpu=50000000L
degz_mizu.menu.freq.100=100 MHz
degz_mizu.menu.freq.100.build.f_cpu=100000000L
degz_mizu.menu.freq.120=120 MHz
degz_mizu.menu.freq.120.build.f_cpu=120000000L
degz_mizu.menu.freq.125=125 MHz
degz_mizu.menu.freq.125.build.f_cpu=125000000L
degz_mizu.menu.freq.150=150 MHz (Overclock)
degz_mizu.menu.freq.150.build.f_cpu=150000000L
degz_mizu.menu.freq.175=175 MHz (Overclock)
degz_mizu.menu.freq.175.build.f_cpu=175000000L
degz_mizu.menu.freq.200=200 MHz (Overclock)
degz_mizu.menu.freq.200.build.f_cpu=200000000L
degz_mizu.menu.freq.225=225 MHz (Overclock)
degz_mizu.menu.freq.225.build.f_cpu=225000000L
degz_mizu.menu.freq.240=240 MHz (Overclock)
degz_mizu.menu.freq.240.build.f_cpu=240000000L
degz_mizu.menu.freq.250=250 MHz (Overclock)
degz_mizu.menu.freq.250.build.f_cpu=250000000L
degz_mizu.menu.freq.275=275 MHz (Overclock)
degz_mizu.menu.freq.275.build.f_cpu=275000000L
degz_mizu.menu.freq.300=300 MHz (Overclock)
degz_mizu.menu.freq.300.build.f_cpu=300000000L
degz_mizu.menu.opt.Small=Small (-Os) (standard)
degz_mizu.menu.opt.Small.build.flags.optimize=-Os
degz_mizu.menu.opt.Optimize=Optimize (-O)
degz_mizu.menu.opt.Optimize.build.flags.optimize=-O
degz_mizu.menu.opt.Optimize2=Optimize More (-O2)
degz_mizu.menu.opt.Optimize2.build.flags.optimize=-O2
degz_mizu.menu.opt.Optimize3=Optimize Even More (-O3)
degz_mizu.menu.opt.Optimize3.build.flags.optimize=-O3
degz_mizu.menu.opt.Fast=Fast (-Ofast) (maybe slower)
degz_mizu.menu.opt.Fast.build.flags.optimize=-Ofast
degz_mizu.menu.opt.Debug=Debug (-Og)
degz_mizu.menu.opt.Debug.build.flags.optimize=-Og
degz_mizu.menu.rtti.Disabled=Disabled
degz_mizu.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
degz_mizu.menu.rtti.Enabled=Enabled
degz_mizu.menu.rtti.Enabled.build.flags.rtti=
degz_mizu.menu.stackprotect.Disabled=Disabled
degz_mizu.menu.stackprotect.Disabled.build.flags.stackprotect=
degz_mizu.menu.stackprotect.Enabled=Enabled
degz_mizu.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
degz_mizu.menu.exceptions.Disabled=Disabled
degz_mizu.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
degz_mizu.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
degz_mizu.menu.exceptions.Enabled=Enabled
degz_mizu.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
degz_mizu.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
degz_mizu.menu.dbgport.Disabled=Disabled
degz_mizu.menu.dbgport.Disabled.build.debug_port=
degz_mizu.menu.dbgport.Serial=Serial
degz_mizu.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
degz_mizu.menu.dbgport.Serial1=Serial1
degz_mizu.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
degz_mizu.menu.dbgport.Serial2=Serial2
degz_mizu.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
degz_mizu.menu.dbglvl.None=None
degz_mizu.menu.dbglvl.None.build.debug_level=
degz_mizu.menu.dbglvl.Core=Core
degz_mizu.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
degz_mizu.menu.dbglvl.SPI=SPI
degz_mizu.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
degz_mizu.menu.dbglvl.Wire=Wire
degz_mizu.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
degz_mizu.menu.dbglvl.All=All
degz_mizu.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
degz_mizu.menu.dbglvl.NDEBUG=NDEBUG
degz_mizu.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
degz_mizu.menu.usbstack.picosdk=Pico SDK
degz_mizu.menu.usbstack.picosdk.build.usbstack_flags=
degz_mizu.menu.usbstack.tinyusb=Adafruit TinyUSB
degz_mizu.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
degz_mizu.menu.ipstack.ipv4only=IPv4 Only
degz_mizu.menu.ipstack.ipv4only.build.libpico=libpico.a
degz_mizu.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
degz_mizu.menu.ipstack.ipv4ipv6=IPv4 and IPv6
degz_mizu.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
degz_mizu.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

