earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# uPesy RP2040 DevKit (Picoprobe)
# -----------------------------------
upesy_rp2040_devkitpicoprobe.name=uPesy RP2040 DevKit (Picoprobe)
upesy_rp2040_devkitpicoprobe.vid.0=0x2e8a
upesy_rp2040_devkitpicoprobe.pid.0=0x0004
upesy_rp2040_devkitpicoprobe.vid.1=0x2e8a
upesy_rp2040_devkitpicoprobe.pid.1=0x0104
upesy_rp2040_devkitpicoprobe.vid.2=0x2e8a
upesy_rp2040_devkitpicoprobe.pid.2=0x4004
upesy_rp2040_devkitpicoprobe.vid.3=0x2e8a
upesy_rp2040_devkitpicoprobe.pid.3=0x4104
upesy_rp2040_devkitpicoprobe.vid.4=0x2e8a
upesy_rp2040_devkitpicoprobe.pid.4=0x8004
upesy_rp2040_devkitpicoprobe.vid.5=0x2e8a
upesy_rp2040_devkitpicoprobe.pid.5=0x8104
upesy_rp2040_devkitpicoprobe.vid.6=0x2e8a
upesy_rp2040_devkitpicoprobe.pid.6=0xc004
upesy_rp2040_devkitpicoprobe.vid.7=0x2e8a
upesy_rp2040_devkitpicoprobe.pid.7=0xc104
upesy_rp2040_devkitpicoprobe.build.usbpid=-DSERIALUSB_PID=0x1007
upesy_rp2040_devkitpicoprobe.build.usbpwr=-DUSBD_MAX_POWER_MA=250
upesy_rp2040_devkitpicoprobe.build.board=UPESY_RP2040_DEVKIT
upesy_rp2040_devkitpicoprobe.build.mcu=cortex-m0plus
upesy_rp2040_devkitpicoprobe.build.variant=upesy_rp2040_devkit
upesy_rp2040_devkitpicoprobe.upload.tool=picoprobe
upesy_rp2040_devkitpicoprobe.upload.maximum_size=2097152
upesy_rp2040_devkitpicoprobe.upload.maximum_data_size=262144
upesy_rp2040_devkitpicoprobe.upload.wait_for_upload_port=true
upesy_rp2040_devkitpicoprobe.upload.erase_cmd=
upesy_rp2040_devkitpicoprobe.serial.disableDTR=false
upesy_rp2040_devkitpicoprobe.serial.disableRTS=false
upesy_rp2040_devkitpicoprobe.build.f_cpu=125000000
upesy_rp2040_devkitpicoprobe.build.led=
upesy_rp2040_devkitpicoprobe.build.core=rp2040
upesy_rp2040_devkitpicoprobe.build.ldscript=memmap_default.ld
upesy_rp2040_devkitpicoprobe.build.ram_length=256k
upesy_rp2040_devkitpicoprobe.build.debugscript=picoprobe.tcl
upesy_rp2040_devkitpicoprobe.build.boot2=boot2_w25q080_2_padded_checksum
upesy_rp2040_devkitpicoprobe.build.vid=0x2e8a
upesy_rp2040_devkitpicoprobe.build.pid=0x1007
upesy_rp2040_devkitpicoprobe.build.usb_manufacturer="uPesy"
upesy_rp2040_devkitpicoprobe.build.usb_product="RP2040 DevKit (Picoprobe)"
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_0=2MB (no FS)
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_0.upload.maximum_size=2093056
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_0.build.flash_length=2093056
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_0.build.eeprom_start=270528512
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_0.build.fs_start=270528512
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_0.build.fs_end=270528512
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_65536.upload.maximum_size=2027520
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_65536.build.flash_length=2027520
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_65536.build.eeprom_start=270528512
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_65536.build.fs_start=270462976
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_65536.build.fs_end=270528512
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_131072.upload.maximum_size=1961984
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_131072.build.flash_length=1961984
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_131072.build.eeprom_start=270528512
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_131072.build.fs_start=270397440
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_131072.build.fs_end=270528512
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_262144.upload.maximum_size=1830912
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_262144.build.flash_length=1830912
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_262144.build.eeprom_start=270528512
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_262144.build.fs_start=270266368
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_262144.build.fs_end=270528512
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_524288.upload.maximum_size=1568768
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_524288.build.flash_length=1568768
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_524288.build.eeprom_start=270528512
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_524288.build.fs_start=270004224
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_524288.build.fs_end=270528512
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_1048576.upload.maximum_size=1044480
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_1048576.build.flash_length=1044480
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_1048576.build.eeprom_start=270528512
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_1048576.build.fs_start=269479936
upesy_rp2040_devkitpicoprobe.menu.flash.2097152_1048576.build.fs_end=270528512
upesy_rp2040_devkitpicoprobe.menu.freq.133=133 MHz
upesy_rp2040_devkitpicoprobe.menu.freq.133.build.f_cpu=133000000L
upesy_rp2040_devkitpicoprobe.menu.freq.50=50 MHz
upesy_rp2040_devkitpicoprobe.menu.freq.50.build.f_cpu=50000000L
upesy_rp2040_devkitpicoprobe.menu.freq.100=100 MHz
upesy_rp2040_devkitpicoprobe.menu.freq.100.build.f_cpu=100000000L
upesy_rp2040_devkitpicoprobe.menu.freq.120=120 MHz
upesy_rp2040_devkitpicoprobe.menu.freq.120.build.f_cpu=120000000L
upesy_rp2040_devkitpicoprobe.menu.freq.125=125 MHz
upesy_rp2040_devkitpicoprobe.menu.freq.125.build.f_cpu=125000000L
upesy_rp2040_devkitpicoprobe.menu.freq.150=150 MHz (Overclock)
upesy_rp2040_devkitpicoprobe.menu.freq.150.build.f_cpu=150000000L
upesy_rp2040_devkitpicoprobe.menu.freq.175=175 MHz (Overclock)
upesy_rp2040_devkitpicoprobe.menu.freq.175.build.f_cpu=175000000L
upesy_rp2040_devkitpicoprobe.menu.freq.200=200 MHz (Overclock)
upesy_rp2040_devkitpicoprobe.menu.freq.200.build.f_cpu=200000000L
upesy_rp2040_devkitpicoprobe.menu.freq.225=225 MHz (Overclock)
upesy_rp2040_devkitpicoprobe.menu.freq.225.build.f_cpu=225000000L
upesy_rp2040_devkitpicoprobe.menu.freq.240=240 MHz (Overclock)
upesy_rp2040_devkitpicoprobe.menu.freq.240.build.f_cpu=240000000L
upesy_rp2040_devkitpicoprobe.menu.freq.250=250 MHz (Overclock)
upesy_rp2040_devkitpicoprobe.menu.freq.250.build.f_cpu=250000000L
upesy_rp2040_devkitpicoprobe.menu.freq.275=275 MHz (Overclock)
upesy_rp2040_devkitpicoprobe.menu.freq.275.build.f_cpu=275000000L
upesy_rp2040_devkitpicoprobe.menu.freq.300=300 MHz (Overclock)
upesy_rp2040_devkitpicoprobe.menu.freq.300.build.f_cpu=300000000L
upesy_rp2040_devkitpicoprobe.menu.opt.Small=Small (-Os) (standard)
upesy_rp2040_devkitpicoprobe.menu.opt.Small.build.flags.optimize=-Os
upesy_rp2040_devkitpicoprobe.menu.opt.Optimize=Optimize (-O)
upesy_rp2040_devkitpicoprobe.menu.opt.Optimize.build.flags.optimize=-O
upesy_rp2040_devkitpicoprobe.menu.opt.Optimize2=Optimize More (-O2)
upesy_rp2040_devkitpicoprobe.menu.opt.Optimize2.build.flags.optimize=-O2
upesy_rp2040_devkitpicoprobe.menu.opt.Optimize3=Optimize Even More (-O3)
upesy_rp2040_devkitpicoprobe.menu.opt.Optimize3.build.flags.optimize=-O3
upesy_rp2040_devkitpicoprobe.menu.opt.Fast=Fast (-Ofast) (maybe slower)
upesy_rp2040_devkitpicoprobe.menu.opt.Fast.build.flags.optimize=-Ofast
upesy_rp2040_devkitpicoprobe.menu.opt.Debug=Debug (-Og)
upesy_rp2040_devkitpicoprobe.menu.opt.Debug.build.flags.optimize=-Og
upesy_rp2040_devkitpicoprobe.menu.rtti.Disabled=Disabled
upesy_rp2040_devkitpicoprobe.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
upesy_rp2040_devkitpicoprobe.menu.rtti.Enabled=Enabled
upesy_rp2040_devkitpicoprobe.menu.rtti.Enabled.build.flags.rtti=
upesy_rp2040_devkitpicoprobe.menu.stackprotect.Disabled=Disabled
upesy_rp2040_devkitpicoprobe.menu.stackprotect.Disabled.build.flags.stackprotect=
upesy_rp2040_devkitpicoprobe.menu.stackprotect.Enabled=Enabled
upesy_rp2040_devkitpicoprobe.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
upesy_rp2040_devkitpicoprobe.menu.exceptions.Disabled=Disabled
upesy_rp2040_devkitpicoprobe.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
upesy_rp2040_devkitpicoprobe.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
upesy_rp2040_devkitpicoprobe.menu.exceptions.Enabled=Enabled
upesy_rp2040_devkitpicoprobe.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
upesy_rp2040_devkitpicoprobe.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
upesy_rp2040_devkitpicoprobe.menu.dbgport.Disabled=Disabled
upesy_rp2040_devkitpicoprobe.menu.dbgport.Disabled.build.debug_port=
upesy_rp2040_devkitpicoprobe.menu.dbgport.Serial=Serial
upesy_rp2040_devkitpicoprobe.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
upesy_rp2040_devkitpicoprobe.menu.dbgport.Serial1=Serial1
upesy_rp2040_devkitpicoprobe.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
upesy_rp2040_devkitpicoprobe.menu.dbgport.Serial2=Serial2
upesy_rp2040_devkitpicoprobe.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
upesy_rp2040_devkitpicoprobe.menu.dbglvl.None=None
upesy_rp2040_devkitpicoprobe.menu.dbglvl.None.build.debug_level=
upesy_rp2040_devkitpicoprobe.menu.dbglvl.Core=Core
upesy_rp2040_devkitpicoprobe.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
upesy_rp2040_devkitpicoprobe.menu.dbglvl.SPI=SPI
upesy_rp2040_devkitpicoprobe.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
upesy_rp2040_devkitpicoprobe.menu.dbglvl.Wire=Wire
upesy_rp2040_devkitpicoprobe.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
upesy_rp2040_devkitpicoprobe.menu.dbglvl.All=All
upesy_rp2040_devkitpicoprobe.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
upesy_rp2040_devkitpicoprobe.menu.dbglvl.NDEBUG=NDEBUG
upesy_rp2040_devkitpicoprobe.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
upesy_rp2040_devkitpicoprobe.menu.usbstack.picosdk=Pico SDK
upesy_rp2040_devkitpicoprobe.menu.usbstack.picosdk.build.usbstack_flags=
upesy_rp2040_devkitpicoprobe.menu.usbstack.tinyusb=Adafruit TinyUSB
upesy_rp2040_devkitpicoprobe.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
upesy_rp2040_devkitpicoprobe.menu.ipstack.ipv4only=IPv4 Only
upesy_rp2040_devkitpicoprobe.menu.ipstack.ipv4only.build.libpico=libpico.a
upesy_rp2040_devkitpicoprobe.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
upesy_rp2040_devkitpicoprobe.menu.ipstack.ipv4ipv6=IPv4 and IPv6
upesy_rp2040_devkitpicoprobe.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
upesy_rp2040_devkitpicoprobe.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

