earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# WIZnet W5100S-EVB-Pico (pico-debug)
# -----------------------------------
wiznet_5100s_evb_picopicodebug.name=WIZnet W5100S-EVB-Pico (pico-debug)
wiznet_5100s_evb_picopicodebug.vid.0=0x1209
wiznet_5100s_evb_picopicodebug.pid.0=0x2488
wiznet_5100s_evb_picopicodebug.vid.1=0x1209
wiznet_5100s_evb_picopicodebug.pid.1=0x2588
wiznet_5100s_evb_picopicodebug.vid.2=0x1209
wiznet_5100s_evb_picopicodebug.pid.2=0x6488
wiznet_5100s_evb_picopicodebug.vid.3=0x1209
wiznet_5100s_evb_picopicodebug.pid.3=0x6588
wiznet_5100s_evb_picopicodebug.vid.4=0x1209
wiznet_5100s_evb_picopicodebug.pid.4=0xa488
wiznet_5100s_evb_picopicodebug.vid.5=0x1209
wiznet_5100s_evb_picopicodebug.pid.5=0xa588
wiznet_5100s_evb_picopicodebug.vid.6=0x1209
wiznet_5100s_evb_picopicodebug.pid.6=0xe488
wiznet_5100s_evb_picopicodebug.vid.7=0x1209
wiznet_5100s_evb_picopicodebug.pid.7=0xe588
wiznet_5100s_evb_picopicodebug.build.usbpid=-DSERIALUSB_PID=0x1027
wiznet_5100s_evb_picopicodebug.build.usbpwr=-DUSBD_MAX_POWER_MA=250
wiznet_5100s_evb_picopicodebug.build.board=WIZNET_5100S_EVB_PICO
wiznet_5100s_evb_picopicodebug.build.mcu=cortex-m0plus
wiznet_5100s_evb_picopicodebug.build.variant=wiznet_5100s_evb_pico
wiznet_5100s_evb_picopicodebug.upload.tool=picodebug
wiznet_5100s_evb_picopicodebug.upload.maximum_size=2097152
wiznet_5100s_evb_picopicodebug.upload.maximum_data_size=245760
wiznet_5100s_evb_picopicodebug.upload.wait_for_upload_port=true
wiznet_5100s_evb_picopicodebug.upload.erase_cmd=
wiznet_5100s_evb_picopicodebug.serial.disableDTR=false
wiznet_5100s_evb_picopicodebug.serial.disableRTS=false
wiznet_5100s_evb_picopicodebug.build.f_cpu=125000000
wiznet_5100s_evb_picopicodebug.build.led=
wiznet_5100s_evb_picopicodebug.build.core=rp2040
wiznet_5100s_evb_picopicodebug.build.ldscript=memmap_default.ld
wiznet_5100s_evb_picopicodebug.build.ram_length=240k
wiznet_5100s_evb_picopicodebug.build.debugscript=picodebug.tcl
wiznet_5100s_evb_picopicodebug.build.boot2=boot2_w25q080_2_padded_checksum
wiznet_5100s_evb_picopicodebug.build.vid=0x2e8a
wiznet_5100s_evb_picopicodebug.build.pid=0x1027
wiznet_5100s_evb_picopicodebug.build.usb_manufacturer="WIZnet"
wiznet_5100s_evb_picopicodebug.build.usb_product="W5100S-EVB-Pico (pico-debug)"
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_0=2MB (no FS)
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_0.upload.maximum_size=2093056
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_0.build.flash_length=2093056
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_0.build.eeprom_start=270528512
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_0.build.fs_start=270528512
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_0.build.fs_end=270528512
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_65536.upload.maximum_size=2027520
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_65536.build.flash_length=2027520
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_65536.build.eeprom_start=270528512
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_65536.build.fs_start=270462976
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_65536.build.fs_end=270528512
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_131072.upload.maximum_size=1961984
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_131072.build.flash_length=1961984
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_131072.build.eeprom_start=270528512
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_131072.build.fs_start=270397440
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_131072.build.fs_end=270528512
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_262144.upload.maximum_size=1830912
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_262144.build.flash_length=1830912
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_262144.build.eeprom_start=270528512
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_262144.build.fs_start=270266368
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_262144.build.fs_end=270528512
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_524288.upload.maximum_size=1568768
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_524288.build.flash_length=1568768
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_524288.build.eeprom_start=270528512
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_524288.build.fs_start=270004224
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_524288.build.fs_end=270528512
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_1048576.upload.maximum_size=1044480
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_1048576.build.flash_length=1044480
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_1048576.build.eeprom_start=270528512
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_1048576.build.fs_start=269479936
wiznet_5100s_evb_picopicodebug.menu.flash.2097152_1048576.build.fs_end=270528512
wiznet_5100s_evb_picopicodebug.menu.freq.133=133 MHz
wiznet_5100s_evb_picopicodebug.menu.freq.133.build.f_cpu=133000000L
wiznet_5100s_evb_picopicodebug.menu.freq.50=50 MHz
wiznet_5100s_evb_picopicodebug.menu.freq.50.build.f_cpu=50000000L
wiznet_5100s_evb_picopicodebug.menu.freq.100=100 MHz
wiznet_5100s_evb_picopicodebug.menu.freq.100.build.f_cpu=100000000L
wiznet_5100s_evb_picopicodebug.menu.freq.120=120 MHz
wiznet_5100s_evb_picopicodebug.menu.freq.120.build.f_cpu=120000000L
wiznet_5100s_evb_picopicodebug.menu.freq.125=125 MHz
wiznet_5100s_evb_picopicodebug.menu.freq.125.build.f_cpu=125000000L
wiznet_5100s_evb_picopicodebug.menu.freq.150=150 MHz (Overclock)
wiznet_5100s_evb_picopicodebug.menu.freq.150.build.f_cpu=150000000L
wiznet_5100s_evb_picopicodebug.menu.freq.175=175 MHz (Overclock)
wiznet_5100s_evb_picopicodebug.menu.freq.175.build.f_cpu=175000000L
wiznet_5100s_evb_picopicodebug.menu.freq.200=200 MHz (Overclock)
wiznet_5100s_evb_picopicodebug.menu.freq.200.build.f_cpu=200000000L
wiznet_5100s_evb_picopicodebug.menu.freq.225=225 MHz (Overclock)
wiznet_5100s_evb_picopicodebug.menu.freq.225.build.f_cpu=225000000L
wiznet_5100s_evb_picopicodebug.menu.freq.240=240 MHz (Overclock)
wiznet_5100s_evb_picopicodebug.menu.freq.240.build.f_cpu=240000000L
wiznet_5100s_evb_picopicodebug.menu.freq.250=250 MHz (Overclock)
wiznet_5100s_evb_picopicodebug.menu.freq.250.build.f_cpu=250000000L
wiznet_5100s_evb_picopicodebug.menu.freq.275=275 MHz (Overclock)
wiznet_5100s_evb_picopicodebug.menu.freq.275.build.f_cpu=275000000L
wiznet_5100s_evb_picopicodebug.menu.freq.300=300 MHz (Overclock)
wiznet_5100s_evb_picopicodebug.menu.freq.300.build.f_cpu=300000000L
wiznet_5100s_evb_picopicodebug.menu.opt.Small=Small (-Os) (standard)
wiznet_5100s_evb_picopicodebug.menu.opt.Small.build.flags.optimize=-Os
wiznet_5100s_evb_picopicodebug.menu.opt.Optimize=Optimize (-O)
wiznet_5100s_evb_picopicodebug.menu.opt.Optimize.build.flags.optimize=-O
wiznet_5100s_evb_picopicodebug.menu.opt.Optimize2=Optimize More (-O2)
wiznet_5100s_evb_picopicodebug.menu.opt.Optimize2.build.flags.optimize=-O2
wiznet_5100s_evb_picopicodebug.menu.opt.Optimize3=Optimize Even More (-O3)
wiznet_5100s_evb_picopicodebug.menu.opt.Optimize3.build.flags.optimize=-O3
wiznet_5100s_evb_picopicodebug.menu.opt.Fast=Fast (-Ofast) (maybe slower)
wiznet_5100s_evb_picopicodebug.menu.opt.Fast.build.flags.optimize=-Ofast
wiznet_5100s_evb_picopicodebug.menu.opt.Debug=Debug (-Og)
wiznet_5100s_evb_picopicodebug.menu.opt.Debug.build.flags.optimize=-Og
wiznet_5100s_evb_picopicodebug.menu.rtti.Disabled=Disabled
wiznet_5100s_evb_picopicodebug.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
wiznet_5100s_evb_picopicodebug.menu.rtti.Enabled=Enabled
wiznet_5100s_evb_picopicodebug.menu.rtti.Enabled.build.flags.rtti=
wiznet_5100s_evb_picopicodebug.menu.stackprotect.Disabled=Disabled
wiznet_5100s_evb_picopicodebug.menu.stackprotect.Disabled.build.flags.stackprotect=
wiznet_5100s_evb_picopicodebug.menu.stackprotect.Enabled=Enabled
wiznet_5100s_evb_picopicodebug.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
wiznet_5100s_evb_picopicodebug.menu.exceptions.Disabled=Disabled
wiznet_5100s_evb_picopicodebug.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
wiznet_5100s_evb_picopicodebug.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
wiznet_5100s_evb_picopicodebug.menu.exceptions.Enabled=Enabled
wiznet_5100s_evb_picopicodebug.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
wiznet_5100s_evb_picopicodebug.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
wiznet_5100s_evb_picopicodebug.menu.dbgport.Disabled=Disabled
wiznet_5100s_evb_picopicodebug.menu.dbgport.Disabled.build.debug_port=
wiznet_5100s_evb_picopicodebug.menu.dbgport.Serial=Serial
wiznet_5100s_evb_picopicodebug.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
wiznet_5100s_evb_picopicodebug.menu.dbgport.Serial1=Serial1
wiznet_5100s_evb_picopicodebug.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
wiznet_5100s_evb_picopicodebug.menu.dbgport.Serial2=Serial2
wiznet_5100s_evb_picopicodebug.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
wiznet_5100s_evb_picopicodebug.menu.dbglvl.None=None
wiznet_5100s_evb_picopicodebug.menu.dbglvl.None.build.debug_level=
wiznet_5100s_evb_picopicodebug.menu.dbglvl.Core=Core
wiznet_5100s_evb_picopicodebug.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
wiznet_5100s_evb_picopicodebug.menu.dbglvl.SPI=SPI
wiznet_5100s_evb_picopicodebug.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
wiznet_5100s_evb_picopicodebug.menu.dbglvl.Wire=Wire
wiznet_5100s_evb_picopicodebug.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
wiznet_5100s_evb_picopicodebug.menu.dbglvl.All=All
wiznet_5100s_evb_picopicodebug.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
wiznet_5100s_evb_picopicodebug.menu.dbglvl.NDEBUG=NDEBUG
wiznet_5100s_evb_picopicodebug.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
wiznet_5100s_evb_picopicodebug.menu.usbstack.nousb=No USB
wiznet_5100s_evb_picopicodebug.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
wiznet_5100s_evb_picopicodebug.menu.ipstack.ipv4only=IPv4 Only
wiznet_5100s_evb_picopicodebug.menu.ipstack.ipv4only.build.libpico=libpico.a
wiznet_5100s_evb_picopicodebug.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
wiznet_5100s_evb_picopicodebug.menu.ipstack.ipv4ipv6=IPv4 and IPv6
wiznet_5100s_evb_picopicodebug.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
wiznet_5100s_evb_picopicodebug.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

