earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Generic RP2040 (pico-debug)
# -----------------------------------
genericpicodebug.name=Generic RP2040 (pico-debug)
genericpicodebug.vid.0=0x1209
genericpicodebug.pid.0=0x2488
genericpicodebug.vid.1=0x1209
genericpicodebug.pid.1=0x2588
genericpicodebug.vid.2=0x1209
genericpicodebug.pid.2=0x6488
genericpicodebug.vid.3=0x1209
genericpicodebug.pid.3=0x6588
genericpicodebug.vid.4=0x1209
genericpicodebug.pid.4=0xa488
genericpicodebug.vid.5=0x1209
genericpicodebug.pid.5=0xa588
genericpicodebug.vid.6=0x1209
genericpicodebug.pid.6=0xe488
genericpicodebug.vid.7=0x1209
genericpicodebug.pid.7=0xe588
genericpicodebug.build.usbpid=-DSERIALUSB_PID=0xf00a
genericpicodebug.build.usbpwr=-DUSBD_MAX_POWER_MA=250
genericpicodebug.build.board=GENERIC_RP2040
genericpicodebug.build.mcu=cortex-m0plus
genericpicodebug.build.variant=generic
genericpicodebug.upload.tool=picodebug
genericpicodebug.upload.maximum_size=16777216
genericpicodebug.upload.maximum_data_size=245760
genericpicodebug.upload.wait_for_upload_port=true
genericpicodebug.upload.erase_cmd=
genericpicodebug.serial.disableDTR=false
genericpicodebug.serial.disableRTS=false
genericpicodebug.build.f_cpu=125000000
genericpicodebug.build.led=
genericpicodebug.build.core=rp2040
genericpicodebug.build.ldscript=memmap_default.ld
genericpicodebug.build.ram_length=240k
genericpicodebug.build.debugscript=picodebug.tcl
genericpicodebug.build.boot2=boot2_generic_03h_4_padded_checksum
genericpicodebug.build.vid=0x2e8a
genericpicodebug.build.pid=0xf00a
genericpicodebug.build.usb_manufacturer="Generic"
genericpicodebug.build.usb_product="RP2040 (pico-debug)"
genericpicodebug.menu.flash.2097152_0=2MB (no FS)
genericpicodebug.menu.flash.2097152_0.upload.maximum_size=2093056
genericpicodebug.menu.flash.2097152_0.build.flash_length=2093056
genericpicodebug.menu.flash.2097152_0.build.eeprom_start=270528512
genericpicodebug.menu.flash.2097152_0.build.fs_start=270528512
genericpicodebug.menu.flash.2097152_0.build.fs_end=270528512
genericpicodebug.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
genericpicodebug.menu.flash.2097152_1048576.upload.maximum_size=1044480
genericpicodebug.menu.flash.2097152_1048576.build.flash_length=1044480
genericpicodebug.menu.flash.2097152_1048576.build.eeprom_start=270528512
genericpicodebug.menu.flash.2097152_1048576.build.fs_start=269479936
genericpicodebug.menu.flash.2097152_1048576.build.fs_end=270528512
genericpicodebug.menu.flash.4194304_0=4MB (no FS)
genericpicodebug.menu.flash.4194304_0.upload.maximum_size=4190208
genericpicodebug.menu.flash.4194304_0.build.flash_length=4190208
genericpicodebug.menu.flash.4194304_0.build.eeprom_start=272625664
genericpicodebug.menu.flash.4194304_0.build.fs_start=272625664
genericpicodebug.menu.flash.4194304_0.build.fs_end=272625664
genericpicodebug.menu.flash.4194304_2097152=4MB (Sketch: 2MB, FS: 2MB)
genericpicodebug.menu.flash.4194304_2097152.upload.maximum_size=2093056
genericpicodebug.menu.flash.4194304_2097152.build.flash_length=2093056
genericpicodebug.menu.flash.4194304_2097152.build.eeprom_start=272625664
genericpicodebug.menu.flash.4194304_2097152.build.fs_start=270528512
genericpicodebug.menu.flash.4194304_2097152.build.fs_end=272625664
genericpicodebug.menu.flash.8388608_0=8MB (no FS)
genericpicodebug.menu.flash.8388608_0.upload.maximum_size=8384512
genericpicodebug.menu.flash.8388608_0.build.flash_length=8384512
genericpicodebug.menu.flash.8388608_0.build.eeprom_start=276819968
genericpicodebug.menu.flash.8388608_0.build.fs_start=276819968
genericpicodebug.menu.flash.8388608_0.build.fs_end=276819968
genericpicodebug.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
genericpicodebug.menu.flash.8388608_4194304.upload.maximum_size=4190208
genericpicodebug.menu.flash.8388608_4194304.build.flash_length=4190208
genericpicodebug.menu.flash.8388608_4194304.build.eeprom_start=276819968
genericpicodebug.menu.flash.8388608_4194304.build.fs_start=272625664
genericpicodebug.menu.flash.8388608_4194304.build.fs_end=276819968
genericpicodebug.menu.flash.16777216_0=16MB (no FS)
genericpicodebug.menu.flash.16777216_0.upload.maximum_size=16773120
genericpicodebug.menu.flash.16777216_0.build.flash_length=16773120
genericpicodebug.menu.flash.16777216_0.build.eeprom_start=285208576
genericpicodebug.menu.flash.16777216_0.build.fs_start=285208576
genericpicodebug.menu.flash.16777216_0.build.fs_end=285208576
genericpicodebug.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
genericpicodebug.menu.flash.16777216_8388608.upload.maximum_size=8384512
genericpicodebug.menu.flash.16777216_8388608.build.flash_length=8384512
genericpicodebug.menu.flash.16777216_8388608.build.eeprom_start=285208576
genericpicodebug.menu.flash.16777216_8388608.build.fs_start=276819968
genericpicodebug.menu.flash.16777216_8388608.build.fs_end=285208576
genericpicodebug.menu.freq.133=133 MHz
genericpicodebug.menu.freq.133.build.f_cpu=133000000L
genericpicodebug.menu.freq.50=50 MHz
genericpicodebug.menu.freq.50.build.f_cpu=50000000L
genericpicodebug.menu.freq.100=100 MHz
genericpicodebug.menu.freq.100.build.f_cpu=100000000L
genericpicodebug.menu.freq.120=120 MHz
genericpicodebug.menu.freq.120.build.f_cpu=120000000L
genericpicodebug.menu.freq.125=125 MHz
genericpicodebug.menu.freq.125.build.f_cpu=125000000L
genericpicodebug.menu.freq.150=150 MHz (Overclock)
genericpicodebug.menu.freq.150.build.f_cpu=150000000L
genericpicodebug.menu.freq.175=175 MHz (Overclock)
genericpicodebug.menu.freq.175.build.f_cpu=175000000L
genericpicodebug.menu.freq.200=200 MHz (Overclock)
genericpicodebug.menu.freq.200.build.f_cpu=200000000L
genericpicodebug.menu.freq.225=225 MHz (Overclock)
genericpicodebug.menu.freq.225.build.f_cpu=225000000L
genericpicodebug.menu.freq.240=240 MHz (Overclock)
genericpicodebug.menu.freq.240.build.f_cpu=240000000L
genericpicodebug.menu.freq.250=250 MHz (Overclock)
genericpicodebug.menu.freq.250.build.f_cpu=250000000L
genericpicodebug.menu.freq.275=275 MHz (Overclock)
genericpicodebug.menu.freq.275.build.f_cpu=275000000L
genericpicodebug.menu.freq.300=300 MHz (Overclock)
genericpicodebug.menu.freq.300.build.f_cpu=300000000L
genericpicodebug.menu.opt.Small=Small (-Os) (standard)
genericpicodebug.menu.opt.Small.build.flags.optimize=-Os
genericpicodebug.menu.opt.Optimize=Optimize (-O)
genericpicodebug.menu.opt.Optimize.build.flags.optimize=-O
genericpicodebug.menu.opt.Optimize2=Optimize More (-O2)
genericpicodebug.menu.opt.Optimize2.build.flags.optimize=-O2
genericpicodebug.menu.opt.Optimize3=Optimize Even More (-O3)
genericpicodebug.menu.opt.Optimize3.build.flags.optimize=-O3
genericpicodebug.menu.opt.Fast=Fast (-Ofast) (maybe slower)
genericpicodebug.menu.opt.Fast.build.flags.optimize=-Ofast
genericpicodebug.menu.opt.Debug=Debug (-Og)
genericpicodebug.menu.opt.Debug.build.flags.optimize=-Og
genericpicodebug.menu.rtti.Disabled=Disabled
genericpicodebug.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
genericpicodebug.menu.rtti.Enabled=Enabled
genericpicodebug.menu.rtti.Enabled.build.flags.rtti=
genericpicodebug.menu.stackprotect.Disabled=Disabled
genericpicodebug.menu.stackprotect.Disabled.build.flags.stackprotect=
genericpicodebug.menu.stackprotect.Enabled=Enabled
genericpicodebug.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
genericpicodebug.menu.exceptions.Disabled=Disabled
genericpicodebug.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
genericpicodebug.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
genericpicodebug.menu.exceptions.Enabled=Enabled
genericpicodebug.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
genericpicodebug.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
genericpicodebug.menu.dbgport.Disabled=Disabled
genericpicodebug.menu.dbgport.Disabled.build.debug_port=
genericpicodebug.menu.dbgport.Serial=Serial
genericpicodebug.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
genericpicodebug.menu.dbgport.Serial1=Serial1
genericpicodebug.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
genericpicodebug.menu.dbgport.Serial2=Serial2
genericpicodebug.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
genericpicodebug.menu.dbglvl.None=None
genericpicodebug.menu.dbglvl.None.build.debug_level=
genericpicodebug.menu.dbglvl.Core=Core
genericpicodebug.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
genericpicodebug.menu.dbglvl.SPI=SPI
genericpicodebug.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
genericpicodebug.menu.dbglvl.Wire=Wire
genericpicodebug.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
genericpicodebug.menu.dbglvl.All=All
genericpicodebug.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
genericpicodebug.menu.dbglvl.NDEBUG=NDEBUG
genericpicodebug.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
genericpicodebug.menu.usbstack.nousb=No USB
genericpicodebug.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
genericpicodebug.menu.ipstack.ipv4only=IPv4 Only
genericpicodebug.menu.ipstack.ipv4only.build.libpico=libpico.a
genericpicodebug.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
genericpicodebug.menu.ipstack.ipv4ipv6=IPv4 and IPv6
genericpicodebug.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
genericpicodebug.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
genericpicodebug.menu.boot2.boot2_generic_03h_2_padded_checksum=Generic SPI /2
genericpicodebug.menu.boot2.boot2_generic_03h_2_padded_checksum.build.boot2=boot2_generic_03h_2_padded_checksum
genericpicodebug.menu.boot2.boot2_generic_03h_4_padded_checksum=Generic SPI /4
genericpicodebug.menu.boot2.boot2_generic_03h_4_padded_checksum.build.boot2=boot2_generic_03h_4_padded_checksum
genericpicodebug.menu.boot2.boot2_is25lp080_2_padded_checksum=IS25LP080 QSPI /2
genericpicodebug.menu.boot2.boot2_is25lp080_2_padded_checksum.build.boot2=boot2_is25lp080_2_padded_checksum
genericpicodebug.menu.boot2.boot2_is25lp080_4_padded_checksum=IS25LP080 QSPI /4
genericpicodebug.menu.boot2.boot2_is25lp080_4_padded_checksum.build.boot2=boot2_is25lp080_4_padded_checksum
genericpicodebug.menu.boot2.boot2_w25q080_2_padded_checksum=W25Q080 QSPI /2
genericpicodebug.menu.boot2.boot2_w25q080_2_padded_checksum.build.boot2=boot2_w25q080_2_padded_checksum
genericpicodebug.menu.boot2.boot2_w25q080_4_padded_checksum=W25Q080 QSPI /4
genericpicodebug.menu.boot2.boot2_w25q080_4_padded_checksum.build.boot2=boot2_w25q080_4_padded_checksum
genericpicodebug.menu.boot2.boot2_w25x10cl_2_padded_checksum=W25X10CL QSPI /2
genericpicodebug.menu.boot2.boot2_w25x10cl_2_padded_checksum.build.boot2=boot2_w25x10cl_2_padded_checksum
genericpicodebug.menu.boot2.boot2_w25x10cl_4_padded_checksum=W25X10CL QSPI /4
genericpicodebug.menu.boot2.boot2_w25x10cl_4_padded_checksum.build.boot2=boot2_w25x10cl_4_padded_checksum
